{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/populism-sca/Log_JP.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Nov 2023, 16:37:38
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD89294.000000"
{txt}
{com}. *|==============================================================================
. *| SCA ESTIMATIONS
. *|------------------------------------------------------------------------------
. 
. 
. *| Argentina
. *|------------------------------------------------------------------------------
. 
. ** Code for sugestion: 
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="BOL"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1990
{txt}(280 observations deleted)

{com}. drop if year > 2013
{txt}(140 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors        = "WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW"
{txt}
{com}. global pre_treatment = "VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2002)"
{txt}
{com}. global treat_y       = "2003"
{txt}
{com}. global x_axis            = "1990(1)2013"
{txt}
{com}. 
. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(2) trperiod($treat_y)             ///
>           unitnames(country) resultsperiod($x_axis)                                                              ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Argentina {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2002){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7502213}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}        {res}.128
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}        {res}.466
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.085
    {txt}Costa Rica {c |}        {res}.072
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}          {res}.1
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}         {res}.15
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3447908}}}{space 1}{space 1}{ralign 9:{res:{sf: .3333721}}}{space 1}
{space 0}{space 0}{ralign 30:WGI2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.2347079}}}{space 1}{space 1}{ralign 9:{res:{sf: .0360591}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 83.37692}}}{space 1}{space 1}{ralign 9:{res:{sf: 74.26436}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 93.96923}}}{space 1}{space 1}{ralign 9:{res:{sf: 88.33071}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 46.26154}}}{space 1}{space 1}{ralign 9:{res:{sf: 45.00145}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.348624}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.092828}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       63}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.5344}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.6534}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.8534}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     65.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  66.6903}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(2) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                         
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 8.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.819502}}}{space 1}{space 1}{ralign 9:{res:{sf: .3703704}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.587097}}}{space 1}{space 1}{ralign 9:{res:{sf: .3333333}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-4.343303}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-5.487101}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -5.6332}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.802898}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.983699}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -8.4482}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.5196}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2749}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2571}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}.                          
. rename  VDEMy_synth     ARG_SCA
{res}{txt}
{com}. rename  effect          ARG_effect
{res}{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ARG_SCA "Argentina"
{txt}
{com}. 
. 
. global title    = "V-Dem: Liberal Democracy Index in Argentina"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Argentina"
{txt}
{com}. global label2   = "Synthetic Argentina"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy          year if id==2, lpattern(solid)                                                ///
>         || line ARG_SCA    year if id==2, lpattern(dash)  xline($treat_graph)            ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) position(6) rows(1)) nodraw
{txt}
{com}.            graph save "Figures/JP/ARG_synth", replace
{res}{txt}file {bf:Figures/JP/ARG_synth.gph} saved

{com}.            
.            
. twoway bar      ARG_effect year if id==2, color(gray%50) xline($treat_graph)             ///
>            yline(0, lpattern(solid))                                                                                     ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle2)
{res}{txt}
{com}.            graph save "Figures/JP/ARG_effect", replace
{res}{txt}file {bf:Figures/JP/ARG_effect.gph} saved

{com}. 
. 
. graph combine "Figures/JP/ARG_synth.gph" "Figures/JP/ARG_effect.gph", xcommon rows(2) ysize(8)
{res}{txt}
{com}.         
. graph export  "Figures/JP/Fig_ARG.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_ARG.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. keep if country_code == "ARG"
{txt}(648 observations deleted)

{com}. rename year             ARG_year
{res}{txt}
{com}. rename VDEMy    ARG_VDEMy
{res}{txt}
{com}. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. generate t = _n - 11, before(ARG_year)
{txt}
{com}. 
. save data_avg_jp, replace
{txt}{p 0 4 2}
(file {bf}
data_avg_jp.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
data_avg_jp.dta{rm}
saved
{p_end}

{com}. 
. 
. *| Bolivia
. *|------------------------------------------------------------------------------
. 
. ** SUGGESTIONS: 
. *| -- Start pre-treatment period in 1992
. *| -- Include lags VDEMy(1992) VDEMy(1995)
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1992
{txt}(336 observations deleted)

{com}. drop if year > 2015
{txt}(84 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM6 polity2 VDEM1 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2004)"
{txt}
{com}. global treat_y       = "2005"
{txt}
{com}. global x_axis            = "1992(1)2015"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(6) trperiod($treat_y)     ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Bolivia {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM6 polity2 VDEM1 ICRG VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2004){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7814995}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}           {res}0
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}        {res}.345
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}        {res}.011
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}        {res}.572
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.072
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 31.63846}}}{space 1}{space 1}{ralign 9:{res:{sf: 23.76163}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.846154}}}{space 1}{space 1}{ralign 9:{res:{sf: 8.205231}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 74.04615}}}{space 1}{space 1}{ralign 9:{res:{sf: 63.92859}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.602564}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.338228}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.7226}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     50.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  50.4291}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.0236}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       53}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.3899}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     51.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.3541}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     54.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  54.6347}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(6) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 6.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.5261004}}}{space 1}{space 1}{ralign 9:{res:{sf: .6666667}}}{space 1}{space 1}{ralign 9:{res:{sf: .7777778}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.032401}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-8.412401}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -12.103}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.6274}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.5303}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.1777}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.2787}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.4313}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.1181}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.9468}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{res}{txt}
{com}. effect_graphs
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.1481481481481481
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.4074074074074074

{txt}macros:
           e(trperiod) : "{res}2005{txt}"
             e(trunit) : "{res}6{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 24 x 2
{txt}
{com}. 
. rename  VDEMy_synth     BOL_SCA
{res}{txt}
{com}. rename  effect          BOL_effect
{res}{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}.                          
. label variable  BOL_SCA "Bolivia"
{txt}
{com}. 
. 
. global title    = "V-Dem: Liberal Democracy Index in Bolivia"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Bolivia"
{txt}
{com}. global label2   = "Synthetic Bolivia"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy          year if id==6, lpattern(solid)                                                ///
>         || line BOL_SCA    year if id==6, lpattern(dash)  xline($treat_graph)            ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) position(6) rows(1)) nodraw
{txt}
{com}.            graph save "Figures/JP/BOL_synth", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/BOL_synth.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/BOL_synth.gph} saved

{com}.            
. twoway bar      BOL_effect year if id==6, color(gray%50) xline($treat_graph)             ///
>            yline(0, lpattern(solid))                                                                                     ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle2) nodraw
{txt}
{com}.            graph save "Figures/JP/BOL_effect", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/BOL_effect.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/BOL_effect.gph} saved

{com}.  
.         
. graph combine "Figures/JP/BOL_synth.gph" "Figures/JP/BOL_effect.gph", xcommon rows(2) ysize(8)
{res}{txt}
{com}. graph export  "Figures/JP/Fig_BOL.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_BOL.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. 
. keep if country_code == "BOL"
{txt}(648 observations deleted)

{com}. rename year             BOL_year
{res}{txt}
{com}. rename VDEMy    BOL_VDEMy
{res}{txt}
{com}. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. generate t = _n - 11, before(BOL_year)
{txt}
{com}. 
. 
. merge 1:1 t using data_avg_jp
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              24{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save data_avg_jp, replace
{txt}{p 0 4 2}
file {bf}
data_avg_jp.dta{rm}
saved
{p_end}

{com}. 
. *| Ecuador
. *|------------------------------------------------------------------------------
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1993
{txt}(364 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "EFW polity2 VDEM4 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1993(1)2017"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(13) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Ecuador {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} EFW polity2 VDEM4 ICRG VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .4401618}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}         {res}.52
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}        {res}.168
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}        {res}.206
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.105
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  6.08495}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.685114}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 7.571429}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.794714}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-98.86429}}}{space 1}{space 1}{ralign 9:{res:{sf:-63.04114}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.943452}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.368083}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.9743}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.8}}}{space 1}{space 1}{ralign 9:{res:{sf:   47.069}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.5823}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.2467}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
.  
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(13) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 5.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.175301}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -15.1945}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -17.365}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.6857}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -23.4345}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -24.051}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -26.2506}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.7279}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.4989}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -23.904}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -16.752}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. effect_graphs
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.037037037037037
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.8518518518518519

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}13{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ECU_SCA
{res}{txt}
{com}. rename  effect          ECU_effect
{res}{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ECU_SCA "Ecuador"
{txt}
{com}. 
. 
. global title    = "V-Dem: Liberal Democracy Index in Ecuador"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Ecuador"
{txt}
{com}. global label2   = "Synthetic Ecuador"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy          year if id==13, lpattern(solid)                                               ///
>         || line ECU_SCA    year if id==13, lpattern(dash)  xline($treat_graph)           ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) position(6) rows(1)) nodraw
{txt}
{com}.             graph save "Figures/JP/ECU_synth", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/ECU_synth.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/ECU_synth.gph} saved

{com}.            
. twoway bar      ECU_effect year if id==13, color(gray%50) xline($treat_graph)            ///
>            yline(0, lpattern(solid))                                                                                     ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle2) nodraw
{txt}
{com}.            graph save "Figures/JP/ECU_effect", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/ECU_effect.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/ECU_effect.gph} saved

{com}.  
.         
. graph combine "Figures/JP/ECU_synth.gph" "Figures/JP/ECU_effect.gph", xcommon rows(2) ysize(8)
{res}{txt}
{com}. graph export  "Figures/JP/Fig_ECU.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_ECU.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. keep if country_code == "ECU"
{txt}(675 observations deleted)

{com}. drop if year > 2017
{txt}(0 observations deleted)

{com}. rename year             ECU_year
{res}{txt}
{com}. rename VDEMy    ECU_VDEMy
{res}{txt}
{com}. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. generate t = _n - 11, before(ECU_year)
{txt}
{com}. 
. merge 1:1 t using data_avg_jp
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               1{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              24{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save data_avg_jp, replace
{txt}{p 0 4 2}
file {bf}
data_avg_jp.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *| Nicaragua
. *|------------------------------------------------------------------------------
. 
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1996
{txt}(448 observations deleted)

{com}. drop if year > 2016
{txt}(56 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM2 VDEM4 WGI1 polity2 WGI3"
{txt}
{com}. global pre_treatment = "VDEMy(1996) VDEMy(2001) VDEMy(2002) VDEMy(2004)"
{txt}
{com}. global treat_y       = "2006"
{txt}
{com}. global x_axis            = "1996(1)2016"
{txt}
{com}. 
. synth VDEMy $predictors $pre_treatment, trunit(21) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           keep(resout_ECU) replace fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Nicaragua {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM2 VDEM4 WGI1 polity2 WGI3 VDEMy(1996) VDEMy(2001) VDEMy(2002) VDEMy(2004){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.328675}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}        {res}.119
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.881
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    87.69}}}{space 1}{space 1}{ralign 9:{res:{sf: 72.78668}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    -6.26}}}{space 1}{space 1}{ralign 9:{res:{sf:-59.26065}}}{space 1}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.0185309}}}{space 1}{space 1}{ralign 9:{res:{sf:-.4716221}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:    5.929}}}{space 1}
{space 0}{space 0}{ralign 30:WGI3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.6491392}}}{space 1}{space 1}{ralign 9:{res:{sf:-.3662565}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1996)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     45.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  39.9394}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.7}}}{space 1}{space 1}{ralign 9:{res:{sf:   39.106}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.8417}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:   39.406}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(21) trperiod($treat_y)                                                                   ///
>                          gen_vars parallel                                                                                               ///
>                          synthsettings(unitnames(country))                                                               ///
>                          graphs
{err}You must use -parallel setclusters XXX- before using the parallel option for -synth_runner-.
{txt}{search r(9), local:r(9);}

end of do-file

{search r(9), local:r(9);}

{com}. drop __000000 __000002
{err}variable {bf}__000000{sf} not found
{txt}{search r(111), local:r(111);}

{com}. do "/var/folders/xd/gksdz50d7r3765bw8t_98y880000gn/T//SD89294.000000"
{txt}
{com}. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(21) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                          graphs
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 6.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-8.115602}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -19.6847}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -21.5014}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.3895}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -25.8849}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -29.7565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -33.2446}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -36.4446}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -37.1732}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -37.3851}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -37.778}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{res}{txt}
{com}. 
. 
. rename  VDEMy_synth     NIC_SCA
{res}{txt}
{com}. rename  effect          NIC_effect
{res}{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  NIC_SCA "Nicaragua"
{txt}
{com}. 
. global title    = "V-Dem: Liberal Democracy Index in Nicaragua"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Nicaragua"
{txt}
{com}. global label2   = "Synthetic Nicaragua"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy          year if id==21, lpattern(solid)                                               ///
>         || line NIC_SCA    year if id==21, lpattern(dash)  xline($treat_graph)           ///
>            xlabel(1995(5)2015)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) position(6) rows(1)) nodraw
{txt}
{com}.             graph save "Figures/JP/NIC_synth", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/NIC_synth.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/NIC_synth.gph} saved

{com}.            
. twoway bar      NIC_effect year if id==21, color(gray%50) xline($treat_graph)            ///
>            yline(0, lpattern(solid))                                                                                     ///
>            xlabel(1995(5)2015)                                                                                                   ///
>            ytitle($ytitle2) nodraw
{txt}
{com}.            graph save "Figures/JP/NIC_effect", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/NIC_effect.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/NIC_effect.gph} saved

{com}.  
.         
. graph combine "Figures/JP/NIC_synth.gph" "Figures/JP/NIC_effect.gph", xcommon rows(2) ysize(8)
{res}{txt}
{com}. graph export  "Figures/JP/Fig_NIC.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_NIC.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. keep if country_code == "NIC"
{txt}(567 observations deleted)

{com}. rename year             NIC_year
{res}{txt}
{com}. rename VDEMy    NIC_VDEMy
{res}{txt}
{com}. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. generate t = _n - 11, before(NIC_year)
{txt}
{com}. 
. merge 1:1 t using data_avg_jp
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               4
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               4{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              21{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save data_avg_jp, replace
{txt}{p 0 4 2}
file {bf}
data_avg_jp.dta{rm}
saved
{p_end}

{com}. 
. *| Suggestion: extend pre-treatment until 1980
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1980
{txt}(0 observations deleted)

{com}. drop if year > 2008
{txt}(280 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "WGI1 VDEM2 VDEM3 polity2 EFW ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1997)"
{txt}
{com}. global treat_y       = "1998"
{txt}
{com}. global x_axis            = "1980(1)2008"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(32) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1981 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1982 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1983 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1984 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1986 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1987 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1988 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1989 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1980 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1981 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1982 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1983 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1984 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1985 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1986 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1987 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1988 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1989 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1983 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Venezuela {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 VDEM2 VDEM3 polity2 EFW ICRG VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1997){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.099376}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}           {res}0
    {txt}Costa Rica {c |}        {res}.437
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}        {res}.279
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}        {res}.284
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.0936463}}}{space 1}{space 1}{ralign 9:{res:{sf: .3446288}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 89.64444}}}{space 1}{space 1}{ralign 9:{res:{sf: 86.53838}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-43.54444}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.844882}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.666667}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.229111}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 5.690285}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.705011}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.958333}}}{space 1}{space 1}{ralign 9:{res:{sf:  3.79747}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1988)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  58.5035}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1991)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  60.4056}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  60.7937}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.9}}}{space 1}{space 1}{ralign 9:{res:{sf:   60.909}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(32) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 7.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-2.798899}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.3033}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -36.5894}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -38.7267}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -42.3247}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -42.5705}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -44.9712}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -48.7512}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -50.7566}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -51.384}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -51.3944}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. rename  VDEMy_synth     VEN_SCA
{res}{txt}
{com}. rename  effect          VEN_effect
{res}{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  VEN_SCA "Ecuador"
{txt}
{com}. 
. 
. global title    = "V-Dem: Liberal Democracy Index in Venezuela"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Venezuela"
{txt}
{com}. global label2   = "Synthetic Venezuela"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy          year if id==32, lpattern(solid)                                               ///
>         || line VEN_SCA    year if id==32, lpattern(dash)  xline($treat_graph)           ///
>            xlabel(1985(5)2010)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) position(6) rows(1)) nodraw
{txt}
{com}.             graph save "Figures/JP/VEN_synth", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/VEN_synth.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/VEN_synth.gph} saved

{com}.            
. twoway bar      VEN_effect year if id==32, color(gray%50) xline($treat_graph)            ///
>            yline(0, lpattern(solid))                                                                                     ///
>            xlabel(1985(5)2010)                                                                                                   ///
>            ytitle($ytitle2) 
{res}{txt}
{com}.            graph save "Figures/JP/VEN_effect", replace
{txt}{p 0 4 2}
(file {bf}
Figures/JP/VEN_effect.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/VEN_effect.gph} saved

{com}.  
.         
. graph combine "Figures/JP/VEN_synth.gph" "Figures/JP/VEN_effect.gph", xcommon rows(2) ysize(8)
{res}{txt}
{com}. graph export  "Figures/JP/Fig_VEN.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_VEN.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}.                          
. 
. keep if country_code == "VEN"
{txt}(783 observations deleted)

{com}. rename year             VEN_year
{res}{txt}
{com}. rename VDEMy    VEN_VDEMy
{res}{txt}
{com}. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. generate t = _n - 11, before(VEN_year)
{txt}
{com}. 
. merge 1:1 t using data_avg_jp
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               4
{txt}{col 9}from master{col 30}{res}               4{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save data_avg_jp, replace
{txt}{p 0 4 2}
file {bf}
data_avg_jp.dta{rm}
saved
{p_end}

{com}. 
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/populism-sca/Log_JP.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Nov 2023, 16:40:44
{txt}{.-}
{smcl}
{txt}{sf}{ul off}