{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/populism-sca/RobustChecks.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Nov 2023, 13:37:21
{txt}
{com}. 
. *| Argentina
. *|------------------------------------------------------------------------------
. 
. * Baseline
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="BOL"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1990
{txt}(280 observations deleted)

{com}. drop if year > 2013
{txt}(140 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors        = "WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW"
{txt}
{com}. global pre_treatment = "VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2002)"
{txt}
{com}. global treat_y       = "2003"
{txt}
{com}. global x_axis            = "1990(1)2013"
{txt}
{com}. 
. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(2) trperiod($treat_y)             ///
>           unitnames(country) resultsperiod($x_axis)                                                              ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Argentina {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2002){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7502213}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}        {res}.128
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}        {res}.466
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.085
    {txt}Costa Rica {c |}        {res}.072
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}          {res}.1
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}         {res}.15
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3447908}}}{space 1}{space 1}{ralign 9:{res:{sf: .3333721}}}{space 1}
{space 0}{space 0}{ralign 30:WGI2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.2347079}}}{space 1}{space 1}{ralign 9:{res:{sf: .0360591}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 83.37692}}}{space 1}{space 1}{ralign 9:{res:{sf: 74.26436}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 93.96923}}}{space 1}{space 1}{ralign 9:{res:{sf: 88.33071}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 46.26154}}}{space 1}{space 1}{ralign 9:{res:{sf: 45.00145}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.348624}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.092828}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       63}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.5344}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.6534}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.8534}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     65.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  66.6903}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(2) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                         
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 9.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.819502}}}{space 1}{space 1}{ralign 9:{res:{sf: .3703704}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.587097}}}{space 1}{space 1}{ralign 9:{res:{sf: .3333333}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-4.343303}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-5.487101}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -5.6332}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.802898}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.983699}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -8.4482}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.5196}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2749}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2571}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list                    

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.1851851851851852
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.5185185185185185

{txt}macros:
           e(trperiod) : "{res}2003{txt}"
             e(trunit) : "{res}2{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 24 x 2
{txt}
{com}.                         
. rename  VDEMy_synth     ARG_BL
{res}{txt}
{com}. drop    effect
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ARG_BL "Baseline: Argentina"
{txt}
{com}. 
. keep if country_code == "ARG"
{txt}(648 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. save RC_ARG, replace
{txt}{p 0 4 2}
file {bf}
RC_ARG.dta{rm}
saved
{p_end}

{com}.                          
. *| Robustness Check 1 - Drop Largest Donor
. *|      -- Largest Donor == Brazil (0.466)
. *|      -- Same specification as in the paper
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="BOL"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. drop if country=="Brazil"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1990
{txt}(270 observations deleted)

{com}. drop if year > 2013
{txt}(135 observations deleted)

{com}. 
. synth VDEMy $predictors $pre_treatment, trunit(2) trperiod($treat_y)             ///
>           unitnames(country) resultsperiod($x_axis)                                                              ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Argentina {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2002){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8281708}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.221
    {txt}Costa Rica {c |}        {res}.601
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}        {res}.008
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}        {res}.169
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3447908}}}{space 1}{space 1}{ralign 9:{res:{sf: .4216941}}}{space 1}
{space 0}{space 0}{ralign 30:WGI2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.2347079}}}{space 1}{space 1}{ralign 9:{res:{sf:-.0245793}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 83.37692}}}{space 1}{space 1}{ralign 9:{res:{sf: 71.37792}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 93.96923}}}{space 1}{space 1}{ralign 9:{res:{sf: 87.12544}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 46.26154}}}{space 1}{space 1}{ralign 9:{res:{sf: 46.64872}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.348624}}}{space 1}{space 1}{ralign 9:{res:{sf:  6.60634}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       63}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.8122}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.4321}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:   62.845}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     65.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  66.7623}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(2) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 26}| Total: 26
.........................| 7.00s elapsed. 

Conducting inference: 5 steps, and 26 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.805204}}}{space 1}{space 1}{ralign 9:{res:{sf: .3461538}}}{space 1}{space 1}{ralign 9:{res:{sf: .1923077}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.537199}}}{space 1}{space 1}{ralign 9:{res:{sf: .3461538}}}{space 1}{space 1}{ralign 9:{res:{sf: .2692308}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-2.205401}}}{space 1}{space 1}{ralign 9:{res:{sf: .2692308}}}{space 1}{space 1}{ralign 9:{res:{sf: .1923077}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-3.793298}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-4.333302}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -5.5832}}}{space 1}{space 1}{ralign 9:{res:{sf: .2692308}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.864501}}}{space 1}{space 1}{ralign 9:{res:{sf: .2692308}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.760002}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2375}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2538}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-9.691397}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list 

{txt}scalars:
               e(n_pl) =  {res}26
          {txt}e(n_pl_used) =  {res}26
    {txt}e(pval_joint_post) =  {res}.1923076923076923
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.5384615384615384

{txt}macros:
           e(trperiod) : "{res}2003{txt}"
             e(trunit) : "{res}2{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 24 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ARG_DL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ARG_DL "RC: Drop Largest"
{txt}
{com}. 
. keep if country_code == "ARG"
{txt}(624 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_ARG
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              24{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ARG, replace
{txt}{p 0 4 2}
file {bf}
RC_ARG.dta{rm}
saved
{p_end}

{com}.                          
.                  
. 
. *| Robustness Check 2 - All Pre-Treatment Lags 
. *|      -- Following Ferman, Pinto & Possebom (2020)
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="BOL"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1990
{txt}(280 observations deleted)

{com}. drop if year > 2013
{txt}(140 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global treat_y       = "2003"
{txt}
{com}. global x_axis            = "1990(1)2013"
{txt}
{com}. 
. 
. synth VDEMy VDEMy(1990) VDEMy(1991) VDEMy(1992) VDEMy(1993) VDEMy(1994)     ///
>           VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998) VDEMy(1999)                   ///
>           VDEMy(2000) VDEMy(2001) VDEMy(2002)                                                                   ///
>           , trunit(2) trperiod($treat_y)                                                                            ///
>           unitnames(country) resultsperiod($x_axis)                                                             ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Argentina {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEMy(1990) VDEMy(1991) VDEMy(1992) VDEMy(1993) VDEMy(1994) VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998) VDEMy(1999) VDEMy(2000) VDEMy(2001) VDEMy(2002){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3604475}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}        {res}.597
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.199
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}         {res}.08
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}        {res}.086
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}        {res}.027
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.011
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEMy(1990)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     61.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  61.0487}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1991)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.4}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.4998}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.6194}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1993)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  63.0435}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       63}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.6904}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     63.3}}}{space 1}{space 1}{ralign 9:{res:{sf:   62.784}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1996)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.4}}}{space 1}{space 1}{ralign 9:{res:{sf:    62.98}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.7283}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.6956}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1999)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     63.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  63.7672}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     66.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  65.9252}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     67.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  66.7161}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     65.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  66.3678}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.  
. 
. synth_runner VDEMy VDEMy(1990) VDEMy(1991) VDEMy(1992) VDEMy(1993)                      ///
>                          VDEMy(1994) VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998)    ///
>                          VDEMy(1999) VDEMy(2000) VDEMy(2001) VDEMy(2002),                               ///
>                          trunit(2) trperiod($treat_y)                                                                   ///
>                          gen_vars synthsettings(unitnames(country))                                             ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 8.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.548202}}}{space 1}{space 1}{ralign 9:{res:{sf: .3333333}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.517096}}}{space 1}{space 1}{ralign 9:{res:{sf: .3333333}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-2.212902}}}{space 1}{space 1}{ralign 9:{res:{sf: .2592593}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-3.197699}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-3.687599}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-5.821997}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.979898}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-8.118599}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.4305}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2637}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-8.750401}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.2222222222222222
  {txt}e(pval_joint_post_s
    td)                =  {res}.037037037037037
    {txt}e(avg_pre_rmspe_p) =  {res}.5555555555555556

{txt}macros:
           e(trperiod) : "{res}2003{txt}"
             e(trunit) : "{res}2{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 24 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ARG_AL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ARG_AL "RC: All Lags"
{txt}
{com}. 
. keep if country_code == "ARG"
{txt}(648 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1  year using RC_ARG
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              24{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ARG, replace
{txt}{p 0 4 2}
file {bf}
RC_ARG.dta{rm}
saved
{p_end}

{com}. 
. *| Robustness Check 3 - Drop Developed Countries
. *| -- Retain the same specification as in the paper
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="BOL"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1990
{txt}(280 observations deleted)

{com}. drop if year > 2013
{txt}(140 observations deleted)

{com}. 
. *| Drop developed counties 
. drop if country=="Australia"
{txt}(24 observations deleted)

{com}. drop if country=="Austria"
{txt}(24 observations deleted)

{com}. drop if country=="Belgium"
{txt}(24 observations deleted)

{com}. drop if country=="Canada"
{txt}(24 observations deleted)

{com}. drop if country=="Denmark"
{txt}(24 observations deleted)

{com}. drop if country=="France"
{txt}(24 observations deleted)

{com}. drop if country=="Germany"
{txt}(24 observations deleted)

{com}. drop if country=="Italy"
{txt}(24 observations deleted)

{com}. drop if country=="Japan"
{txt}(24 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(24 observations deleted)

{com}. drop if country=="Portugal"
{txt}(24 observations deleted)

{com}. drop if country=="Spain"
{txt}(24 observations deleted)

{com}. drop if country=="Sweden"
{txt}(24 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"       
{txt}(24 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors        = "WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW"
{txt}
{com}. global pre_treatment = "VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2002)"
{txt}
{com}. global treat_y       = "2003"
{txt}
{com}. global x_axis            = "1990(1)2013"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(2) trperiod($treat_y)             ///
>           unitnames(country) resultsperiod($x_axis)                                                              ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Argentina {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Nigeria, Paraguay, Peru, Thailand, Turkey, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2002){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8278021}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
   Algeria {c |}           {res}0
    {txt}Brazil {c |}        {res}.197
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}        {res}.186
{txt}Costa Rica {c |}        {res}.458
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}           {res}0
   {txt}Nigeria {c |}        {res}.159
  {txt}Paraguay {c |}           {res}0
      {txt}Peru {c |}           {res}0
  {txt}Thailand {c |}           {res}0
    {txt}Turkey {c |}           {res}0
   {txt}Uruguay {c |}           {res}0
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3447908}}}{space 1}{space 1}{ralign 9:{res:{sf: .3446003}}}{space 1}
{space 0}{space 0}{ralign 30:WGI2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.2347079}}}{space 1}{space 1}{ralign 9:{res:{sf:-.1256664}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 83.37692}}}{space 1}{space 1}{ralign 9:{res:{sf: 72.37288}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 93.96923}}}{space 1}{space 1}{ralign 9:{res:{sf: 87.36831}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 46.26154}}}{space 1}{space 1}{ralign 9:{res:{sf: 47.98989}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.348624}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.318961}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       63}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.6946}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.4754}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.8456}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     65.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  66.6426}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(2) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                         
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 13}| Total: 13
............| 2.00s elapsed. 

Conducting inference: 5 steps, and 13 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.760003}}}{space 1}{space 1}{ralign 9:{res:{sf: .6153846}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-1.508298}}}{space 1}{space 1}{ralign 9:{res:{sf: .6153846}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-3.038201}}}{space 1}{space 1}{ralign 9:{res:{sf: .5384615}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-4.476899}}}{space 1}{space 1}{ralign 9:{res:{sf: .3846154}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-4.813901}}}{space 1}{space 1}{ralign 9:{res:{sf: .3846154}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -6.0387}}}{space 1}{space 1}{ralign 9:{res:{sf: .4615385}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -7.2834}}}{space 1}{space 1}{ralign 9:{res:{sf: .4615385}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-8.108002}}}{space 1}{space 1}{ralign 9:{res:{sf: .3846154}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.5148}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.4125}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.0907}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}13
          {txt}e(n_pl_used) =  {res}13
    {txt}e(pval_joint_post) =  {res}.3846153846153846
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.9230769230769231

{txt}macros:
           e(trperiod) : "{res}2003{txt}"
             e(trunit) : "{res}2{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 24 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ARG_DD
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ARG_DD "RC: Drop Developed"
{txt}
{com}. 
. keep if country_code == "ARG"
{txt}(312 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_ARG
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              24{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ARG, replace
{txt}{p 0 4 2}
file {bf}
RC_ARG.dta{rm}
saved
{p_end}

{com}. 
. 
. *| Robustness Check 4 - Only Latin American Donor
. *| -- Retain the same specification as in the paper
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="BOL"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1990
{txt}(280 observations deleted)

{com}. drop if year > 2013
{txt}(140 observations deleted)

{com}. 
. 
. *| Drop non-Latin American countries
. drop if country=="Algeria"
{txt}(24 observations deleted)

{com}. drop if country=="Nigeria"
{txt}(24 observations deleted)

{com}. drop if country=="Thailand"
{txt}(24 observations deleted)

{com}. drop if country=="Turkey"
{txt}(24 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors        = "WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW"
{txt}
{com}. global pre_treatment = "VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2001) VDEMy(2002)"
{txt}
{com}. global treat_y       = "2003"
{txt}
{com}. global x_axis            = "1990(1)2013"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(2) trperiod($treat_y)             ///
>           unitnames(country) resultsperiod($x_axis)                                                              ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI2 in period 2001 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 23 of out 23 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Argentina {p_end}
{txt}{p 15 30 0} Control Units: {res}Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Paraguay, Peru, Portugal, Spain, Sweden, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 WGI2 VDEM1 VDEM2 VDEM5 EFW VDEMy(1994) VDEMy(1997) VDEMy(1998) VDEMy(2001) VDEMy(2002){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8760545}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
     Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}        {res}.582
        {txt}Canada {c |}        {res}.077
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.218
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}        {res}.064
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
{txt}United Kingdom {c |}         {res}.06
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3447908}}}{space 1}{space 1}{ralign 9:{res:{sf: .2765063}}}{space 1}
{space 0}{space 0}{ralign 30:WGI2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.2347079}}}{space 1}{space 1}{ralign 9:{res:{sf:-.1192216}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 83.37692}}}{space 1}{space 1}{ralign 9:{res:{sf: 75.33978}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 93.96923}}}{space 1}{space 1}{ralign 9:{res:{sf: 85.82988}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 46.26154}}}{space 1}{space 1}{ralign 9:{res:{sf: 47.33513}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.348624}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.097814}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       63}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.5521}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.9631}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.9027}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     67.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  66.2808}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     65.9}}}{space 1}{space 1}{ralign 9:{res:{sf:   66.833}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(2) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 23}| Total: 23
......................| 5.00s elapsed. 

Conducting inference: 5 steps, and 23 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-2.485002}}}{space 1}{space 1}{ralign 9:{res:{sf:  .173913}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-2.467096}}}{space 1}{space 1}{ralign 9:{res:{sf:  .173913}}}{space 1}{space 1}{ralign 9:{res:{sf: .1304348}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-5.788103}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf: .1304348}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.993901}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf: .0434783}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -6.8927}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-8.111897}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -9.2273}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.0987}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.1611}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -11.6798}}}{space 1}{space 1}{ralign 9:{res:{sf: .0869565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -11.6907}}}{space 1}{space 1}{ralign 9:{res:{sf: .0434783}}}{space 1}{space 1}{ralign 9:{res:{sf: .0434783}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}23
          {txt}e(n_pl_used) =  {res}23
    {txt}e(pval_joint_post) =  {res}.0869565217391304
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.391304347826087

{txt}macros:
           e(trperiod) : "{res}2003{txt}"
             e(trunit) : "{res}2{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 24 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ARG_LA
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ARG_LA "RC: Argentina"
{txt}
{com}. 
. keep if country_code == "ARG"
{txt}(552 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_ARG
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              24{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ARG, replace
{txt}{p 0 4 2}
file {bf}
RC_ARG.dta{rm}
saved
{p_end}

{com}. 
. 
. global title    = "V-Dem: Liberal Democracy Index in Argentina"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Argentina"
{txt}
{com}. global label2   = "Baseline Synthetic"
{txt}
{com}. global label3   = "RC: Drop Largest Donor"
{txt}
{com}. global label4   = "RC: All Pre-Treat Lags"
{txt}
{com}. global label5   = "RC: Drop Developed"
{txt}
{com}. global label6   = "RC: Latin America Only"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy         year, lpattern(solid) lwidth (medthick)        ///
>         || line ARG_BL    year, lpattern(dash) lwidth(medthick) lcolor(stred)    ///
>         || line ARG_DL    year, lpattern(shortdash) lwidth(medthin) lcolor(gray%85)      ///
>         || line ARG_AL    year, lpattern(shortdash_dot) lwidth(medthin) lcolor(gray%85)  ///
>         || line ARG_DD    year, lpattern(longdash) lwidth(medthin) lcolor(gray%85)       ///
>         || line ARG_LA    year, lpattern(longdash_dot) lwidth(medthin) lcolor(gray%85)   ///
>            xline($treat_graph)   ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) label(3 $label3)                     ///
>            label(4 $label4) label(5 $label5) label(6 $label6)                                   ///
>            position(6) rows(2)) 
{res}{txt}
{com}.            graph save "Figures/JP/ARG_RC", replace   
{res}{txt}file {bf:Figures/JP/ARG_RC.gph} saved

{com}. 
. graph export  "Figures/JP/Fig_RC_ARG.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_RC_ARG.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. 
. *| Bolivia
. *|------------------------------------------------------------------------------
. 
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1992
{txt}(336 observations deleted)

{com}. drop if year > 2016
{txt}(56 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM6 polity2 VDEM1 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005)"
{txt}
{com}. global treat_y       = "2006"
{txt}
{com}. global x_axis            = "1992(1)2015"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(6) trperiod($treat_y)     ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
> 
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Bolivia {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM6 polity2 VDEM1 ICRG VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7265876}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}        {res}.032
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}        {res}.067
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}           {res}0
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}          {res}.3
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}        {res}.508
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.093
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 31.55714}}}{space 1}{space 1}{ralign 9:{res:{sf: 24.35435}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.785714}}}{space 1}{space 1}{ralign 9:{res:{sf:    8.035}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 74.14286}}}{space 1}{space 1}{ralign 9:{res:{sf: 63.82192}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.559524}}}{space 1}{space 1}{ralign 9:{res:{sf:  2.49614}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.5828}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     50.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  50.3865}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.0737}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       53}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.3398}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     51.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.2608}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2005)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     54.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  54.1959}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(6) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 7.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -6.1534}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.471201}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -11.264}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.6933}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -16.553}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.1966}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.4098}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.0103}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.1422}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.9798}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.3332}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.1481481481481481
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.4814814814814815

{txt}macros:
           e(trperiod) : "{res}2006{txt}"
             e(trunit) : "{res}6{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. ereturn list                    

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.1481481481481481
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.4814814814814815

{txt}macros:
           e(trperiod) : "{res}2006{txt}"
             e(trunit) : "{res}6{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}.                         
. rename  VDEMy_synth     BOL_BL
{res}{txt}
{com}. drop    effect
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  BOL_BL "Baseline: Bolivia"
{txt}
{com}. 
. keep if country_code == "BOL"
{txt}(675 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. save RC_BOL, replace
{txt}{p 0 4 2}
file {bf}
RC_BOL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *| Robustness Check 1 - Drop Largest Donor
. *|      -- Largest Donor == Paraguay (0.508)
. *|      -- Same specification as suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if country=="Paraguay"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1992
{txt}(324 observations deleted)

{com}. drop if year > 2016
{txt}(54 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM6 polity2 VDEM1 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005)"
{txt}
{com}. global treat_y       = "2006"
{txt}
{com}. global x_axis            = "1992(1)2015"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(6) trperiod($treat_y)     ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Bolivia {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM6 polity2 VDEM1 ICRG VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  .860917}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}        {res}.143
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}        {res}.316
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.237
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}        {res}.131
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.174
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 31.55714}}}{space 1}{space 1}{ralign 9:{res:{sf: 23.25775}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.785714}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.715143}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 74.14286}}}{space 1}{space 1}{ralign 9:{res:{sf: 63.51588}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.559524}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.675286}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.6625}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     50.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  50.3943}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.1835}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       53}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.5404}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     51.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.7391}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2005)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     54.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  53.9833}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(6) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 26}| Total: 26
.........................| 6.00s elapsed. 

Conducting inference: 5 steps, and 26 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-4.082401}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-4.672302}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.871402}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-9.754999}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.2373}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -15.6265}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -16.9354}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -16.2157}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.9872}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.7083}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -10.2967}}}{space 1}{space 1}{ralign 9:{res:{sf: .1923077}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}
{res}{txt}
{com}. ereturn list 

{txt}scalars:
               e(n_pl) =  {res}26
          {txt}e(n_pl_used) =  {res}26
    {txt}e(pval_joint_post) =  {res}.1538461538461539
  {txt}e(pval_joint_post_s
    td)                =  {res}.0384615384615385
    {txt}e(avg_pre_rmspe_p) =  {res}.3846153846153846

{txt}macros:
           e(trperiod) : "{res}2006{txt}"
             e(trunit) : "{res}6{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     BOL_DL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  BOL_DL "RC: Drop Largest"
{txt}
{com}. 
. keep if country_code == "BOL"
{txt}(650 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_BOL
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_BOL, replace
{txt}{p 0 4 2}
file {bf}
RC_BOL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. *| Robustness Check 2 - All Pre-Treatment Lags 
. *|      -- Following Ferman, Pinto & Possebom (2020)
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1992
{txt}(336 observations deleted)

{com}. drop if year > 2016
{txt}(56 observations deleted)

{com}. 
. 
. global treat_y       = "2006"
{txt}
{com}. global x_axis            = "1992(1)2015"
{txt}
{com}. 
. 
. synth VDEMy VDEMy(1992) VDEMy(1993) VDEMy(1994)                                                          ///
>           VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998) VDEMy(1999)                   ///
>           VDEMy(2000) VDEMy(2001) VDEMy(2002) VDEMy(2003) VDEMy(2004) VDEMy(2005),      ///
>           trunit(6) trperiod($treat_y)                                                          ///
>           unitnames(country) resultsperiod($x_axis)                                                             ///
> 
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Bolivia {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEMy(1992) VDEMy(1993) VDEMy(1994) VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998) VDEMy(1999) VDEMy(2000) VDEMy(2001) VDEMy(2002) VDEMy(2003) VDEMy(2004) VDEMy(2005){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .5468588}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}        {res}.132
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}        {res}.322
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}           {res}0
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}        {res}.037
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}        {res}.332
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.069
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}        {res}.108
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.3749}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1993)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     48.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  48.7991}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     49.4}}}{space 1}{space 1}{ralign 9:{res:{sf:  49.6778}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     50.3}}}{space 1}{space 1}{ralign 9:{res:{sf:   50.247}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1996)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     50.3}}}{space 1}{space 1}{ralign 9:{res:{sf:   50.967}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  51.6712}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.2751}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1999)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.4382}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       53}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.9191}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.9691}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     51.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.7199}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       53}}}{space 1}{space 1}{ralign 9:{res:{sf:    53.16}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     54.9}}}{space 1}{space 1}{ralign 9:{res:{sf:   54.198}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2005)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     54.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  54.1738}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.     
. synth_runner VDEMy VDEMy(1992) VDEMy(1993)                                                                      ///
>                          VDEMy(1994) VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998)    ///
>                          VDEMy(1999) VDEMy(2000) VDEMy(2001) VDEMy(2002) VDEMy(2003)    ///
>                          VDEMy(2004) VDEMy(2005), trunit(6) trperiod($treat_y)                  ///
>                          gen_vars synthsettings(unitnames(country))                                             ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 10.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.095301}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.899102}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-9.927501}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.0525}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -15.0296}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -15.027}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -15.0345}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.1556}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -11.7306}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.5583}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.0943}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.1481481481481481
  {txt}e(pval_joint_post_s
    td)                =  {res}.037037037037037
    {txt}e(avg_pre_rmspe_p) =  {res}.4444444444444444

{txt}macros:
           e(trperiod) : "{res}2006{txt}"
             e(trunit) : "{res}6{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     BOL_AL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  BOL_AL "RC: All Lags"
{txt}
{com}. 
. keep if country_code == "BOL"
{txt}(675 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1  year using RC_BOL
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_BOL, replace
{txt}{p 0 4 2}
file {bf}
RC_BOL.dta{rm}
saved
{p_end}

{com}. 
. 
. *| Robustness Check 3 - Drop Developed Countries
. *| -- Retain the same specification as suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1992
{txt}(336 observations deleted)

{com}. drop if year > 2016
{txt}(56 observations deleted)

{com}. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(25 observations deleted)

{com}. drop if country=="Austria"
{txt}(25 observations deleted)

{com}. drop if country=="Belgium"
{txt}(25 observations deleted)

{com}. drop if country=="Canada"
{txt}(25 observations deleted)

{com}. drop if country=="Denmark"
{txt}(25 observations deleted)

{com}. drop if country=="France"
{txt}(25 observations deleted)

{com}. drop if country=="Germany"
{txt}(25 observations deleted)

{com}. drop if country=="Italy"
{txt}(25 observations deleted)

{com}. drop if country=="Japan"
{txt}(25 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(25 observations deleted)

{com}. drop if country=="Portugal"
{txt}(25 observations deleted)

{com}. drop if country=="Spain"
{txt}(25 observations deleted)

{com}. drop if country=="Sweden"
{txt}(25 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(25 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM6 polity2 VDEM1 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005)"
{txt}
{com}. global treat_y       = "2006"
{txt}
{com}. global x_axis            = "1992(1)2015"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(6) trperiod($treat_y)     ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Bolivia {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Nigeria, Paraguay, Peru, Thailand, Turkey, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM6 polity2 VDEM1 ICRG VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7244578}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
   Algeria {c |}        {res}.063
    {txt}Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}           {res}0
{txt}Costa Rica {c |}        {res}.221
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}           {res}0
   {txt}Nigeria {c |}           {res}0
  {txt}Paraguay {c |}        {res}.554
      {txt}Peru {c |}           {res}0
  {txt}Thailand {c |}        {res}.064
    {txt}Turkey {c |}           {res}0
   {txt}Uruguay {c |}        {res}.098
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 31.55714}}}{space 1}{space 1}{ralign 9:{res:{sf: 25.59032}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.785714}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.525143}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 74.14286}}}{space 1}{space 1}{ralign 9:{res:{sf: 63.32612}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.559524}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.516131}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.3172}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     50.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  50.4144}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.6}}}{space 1}{space 1}{ralign 9:{res:{sf:    51.84}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       53}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.1381}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     51.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.3843}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2005)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     54.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  54.3966}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(6) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 13}| Total: 13
............| 2.00s elapsed. 

Conducting inference: 5 steps, and 13 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.461901}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.733102}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -11.7503}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.2234}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.2748}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.6489}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.4612}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.7218}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.6507}}}{space 1}{space 1}{ralign 9:{res:{sf: .3076923}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.3316}}}{space 1}{space 1}{ralign 9:{res:{sf: .3076923}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -14.447}}}{space 1}{space 1}{ralign 9:{res:{sf: .3076923}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}13
          {txt}e(n_pl_used) =  {res}13
    {txt}e(pval_joint_post) =  {res}.3076923076923077
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}1

{txt}macros:
           e(trperiod) : "{res}2006{txt}"
             e(trunit) : "{res}6{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     BOL_DD
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  BOL_DD "RC: Drop Developed"
{txt}
{com}. 
. keep if country_code == "BOL"
{txt}(325 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_BOL
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_BOL, replace
{txt}{p 0 4 2}
file {bf}
RC_BOL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *| Robustness Check 4 - Only Latin American Donor
. *| -- Retain the same specification as the suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(39 observations deleted)

{com}. drop if country=="Austria"
{txt}(39 observations deleted)

{com}. drop if country=="Belgium"
{txt}(39 observations deleted)

{com}. drop if country=="Canada"
{txt}(39 observations deleted)

{com}. drop if country=="Denmark"
{txt}(39 observations deleted)

{com}. drop if country=="France"
{txt}(39 observations deleted)

{com}. drop if country=="Germany"
{txt}(39 observations deleted)

{com}. drop if country=="Italy"
{txt}(39 observations deleted)

{com}. drop if country=="Japan"
{txt}(39 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(39 observations deleted)

{com}. drop if country=="Portugal"
{txt}(39 observations deleted)

{com}. drop if country=="Spain"
{txt}(39 observations deleted)

{com}. drop if country=="Sweden"
{txt}(39 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(39 observations deleted)

{com}. 
. * Drop non-Latin American
. drop if country=="Algeria"
{txt}(39 observations deleted)

{com}. drop if country=="Nigeria"
{txt}(39 observations deleted)

{com}. drop if country=="Thailand"
{txt}(39 observations deleted)

{com}. drop if country=="Turkey"
{txt}(39 observations deleted)

{com}. 
. 
. drop if year < 1992
{txt}(120 observations deleted)

{com}. drop if year > 2016
{txt}(20 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM6 polity2 VDEM1 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005)"
{txt}
{com}. global treat_y       = "2006"
{txt}
{com}. global x_axis            = "1992(1)2015"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(6) trperiod($treat_y)     ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Bolivia {p_end}
{txt}{p 15 30 0} Control Units: {res}Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Paraguay, Peru, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM6 polity2 VDEM1 ICRG VDEMy(1992) VDEMy(1995) VDEMy(1998) VDEMy(2000) VDEMy(2002) VDEMy(2005){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8924235}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
    Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}           {res}0
{txt}Costa Rica {c |}        {res}.206
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}        {res}.017
  {txt}Paraguay {c |}        {res}.706
      {txt}Peru {c |}           {res}0
   {txt}Uruguay {c |}        {res}.071
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 31.55714}}}{space 1}{space 1}{ralign 9:{res:{sf: 24.08428}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.785714}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.907571}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 74.14286}}}{space 1}{space 1}{ralign 9:{res:{sf:  64.0044}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.559524}}}{space 1}{space 1}{ralign 9:{res:{sf:  2.39497}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.8313}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     50.3}}}{space 1}{space 1}{ralign 9:{res:{sf:    50.47}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     52.6}}}{space 1}{space 1}{ralign 9:{res:{sf:   51.471}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       53}}}{space 1}{space 1}{ralign 9:{res:{sf:  51.9501}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     51.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  52.0901}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2005)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     54.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  54.9093}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.  
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(6) trperiod($treat_y)                                                                    ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 9}| Total: 9
........| 1.00s elapsed. 

Conducting inference: 5 steps, and 9 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-8.261301}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-9.643302}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.3237}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -15.954}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -19.0973}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -19.0838}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.3788}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.8274}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.4246}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -16.1398}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -16.4151}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}9
          {txt}e(n_pl_used) =  {res}9
    {txt}e(pval_joint_post) =  {res}.1111111111111111
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}1

{txt}macros:
           e(trperiod) : "{res}2006{txt}"
             e(trunit) : "{res}6{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     BOL_LA
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  BOL_LA "RC: Latin America Only"
{txt}
{com}. 
. keep if country_code == "BOL"
{txt}(225 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_BOL
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_BOL, replace
{txt}{p 0 4 2}
file {bf}
RC_BOL.dta{rm}
saved
{p_end}

{com}. 
. 
. global title    = "V-Dem: Liberal Democracy Index in Bolivia"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Bolivia"
{txt}
{com}. global label2   = "Baseline Synthetic"
{txt}
{com}. global label3   = "RC: Drop Largest Donor"
{txt}
{com}. global label4   = "RC: All Pre-Treat Lags"
{txt}
{com}. global label5   = "RC: Drop Developed"
{txt}
{com}. global label6   = "RC: Latin America Only"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy         year, lpattern(solid) lwidth (medthick)        ///
>         || line BOL_BL    year, lpattern(dash) lwidth(medthick) lcolor(stred)    ///
>         || line BOL_DL    year, lpattern(shortdash) lwidth(medthin) lcolor(gray%85)      ///
>         || line BOL_AL    year, lpattern(shortdash_dot) lwidth(medthin) lcolor(gray%85)  ///
>         || line BOL_DD    year, lpattern(longdash) lwidth(medthin) lcolor(gray%85)       ///
>         || line BOL_LA    year, lpattern(longdash_dot) lwidth(medthin) lcolor(gray%85)   ///
>            xline($treat_graph)   ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) label(3 $label3)                     ///
>            label(4 $label4) label(5 $label5) label(6 $label6)                                   ///
>            position(6) rows(2)) 
{res}{txt}
{com}.            graph save "Figures/JP/BOL_RC", replace   
{txt}{p 0 4 2}
(file {bf}
Figures/JP/BOL_RC.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/BOL_RC.gph} saved

{com}. 
. graph export  "Figures/JP/Fig_RC_BOL.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_RC_BOL.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. 
. *| Ecuador
. *|------------------------------------------------------------------------------
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1993
{txt}(364 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "EFW polity2 VDEM4 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1993(1)2017"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(13) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
> 
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Ecuador {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} EFW polity2 VDEM4 ICRG VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .4401618}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}         {res}.52
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}        {res}.168
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}        {res}.206
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.105
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  6.08495}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.685114}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 7.571429}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.794714}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-98.86429}}}{space 1}{space 1}{ralign 9:{res:{sf:-63.04114}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.943452}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.368083}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.9743}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.8}}}{space 1}{space 1}{ralign 9:{res:{sf:   47.069}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.5823}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.2467}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.  
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(13) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 6.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.175301}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -15.1945}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -17.365}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.6857}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -23.4345}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -24.051}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -26.2506}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.7279}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.4989}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -23.904}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -16.752}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list                    

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.037037037037037
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.8518518518518519

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}13{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}.                         
. rename  VDEMy_synth     ECU_BL
{res}{txt}
{com}. drop    effect
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ECU_BL "Baseline: Ecuador"
{txt}
{com}. 
. keep if country_code == "ECU"
{txt}(675 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. save RC_ECU, replace
{txt}{p 0 4 2}
(file {bf}
RC_ECU.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
RC_ECU.dta{rm}
saved
{p_end}

{com}. 
. 
. *| Robustness Check 1 - Drop Largest Donor
. *|      -- Largest Donor == Colombia (0.520)
. *|      -- Same specification as suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if country=="Colombia"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1993
{txt}(351 observations deleted)

{com}. drop if year > 2017
{txt}(27 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "EFW polity2 VDEM4 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1993(1)2017"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(13) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 26 of out 26 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Ecuador {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} EFW polity2 VDEM4 ICRG VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.297192}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}         {res}.15
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}        {res}.023
         {txt}Chile {c |}           {res}0
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}        {res}.276
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}        {res}.454
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.097
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  6.08495}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.787398}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 7.571429}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.666286}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-98.86429}}}{space 1}{space 1}{ralign 9:{res:{sf:-42.75047}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.943452}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.230932}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.2822}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.0996}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.9339}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.6218}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(13) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 26}| Total: 26
.........................| 6.00s elapsed. 

Conducting inference: 5 steps, and 26 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -6.4348}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -15.973}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.3559}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.0674}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.7358}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -20.799}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -21.0901}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -19.673}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -19.3446}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.8636}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -11.6625}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{res}{txt}
{com}. ereturn list 

{txt}scalars:
               e(n_pl) =  {res}26
          {txt}e(n_pl_used) =  {res}26
    {txt}e(pval_joint_post) =  {res}.0769230769230769
  {txt}e(pval_joint_post_s
    td)                =  {res}.0384615384615385
    {txt}e(avg_pre_rmspe_p) =  {res}.3461538461538461

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}13{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ECU_DL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ECU_DL "RC: Drop Largest"
{txt}
{com}. 
. keep if country_code == "ECU"
{txt}(650 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_ECU
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ECU, replace
{txt}{p 0 4 2}
file {bf}
RC_ECU.dta{rm}
saved
{p_end}

{com}. 
. 
. * Robustness Check 2 - All Pre-Treatment Lags 
. *       -- Following Ferman, Pinto & Possebom (2020)
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1993
{txt}(364 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1993(1)2017"
{txt}
{com}. 
. 
. synth VDEMy VDEMy(1993) VDEMy(1994)     ///
>           VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998) VDEMy(1999)                   ///
>           VDEMy(2000) VDEMy(2001) VDEMy(2002) VDEMy(2003) VDEMy(2004)                   ///
>           VDEMy(2005) VDEMy(2006), trunit(13) trperiod($treat_y)                                ///
>           unitnames(country) resultsperiod($x_axis)                                                             ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Ecuador {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEMy(1993) VDEMy(1994) VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1998) VDEMy(1999) VDEMy(2000) VDEMy(2001) VDEMy(2002) VDEMy(2003) VDEMy(2004) VDEMy(2005) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3699185}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.631
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}         {res}.16
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}        {res}.095
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.114
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEMy(1993)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       47}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.5711}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.5655}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.5}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.7693}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1996)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.4009}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.1516}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.0971}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1999)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       47}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.8234}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.2327}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.1782}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.0941}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.4268}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.6955}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2005)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     48.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.7836}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.8438}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.     
. synth_runner VDEMy VDEMy(1993) VDEMy(1994) VDEMy(1995) VDEMy(1996)                      ///
>                          VDEMy(1997) VDEMy(1998) VDEMy(1999) VDEMy(2000) VDEMy(2001)    ///
>                          VDEMy(2002) VDEMy(2003) VDEMy(2004) VDEMy(2005) VDEMy(2006),   ///
>                          trunit(13) trperiod($treat_y)                                                                  ///
>                          gen_vars synthsettings(unitnames(country))                                             ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 10.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-5.722701}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -14.4565}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -16.5238}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.1575}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -23.4279}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.3178}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -27.3223}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -25.5504}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -25.3661}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -24.692}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.5483}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.0740740740740741
  {txt}e(pval_joint_post_s
    td)                =  {res}.037037037037037
    {txt}e(avg_pre_rmspe_p) =  {res}.6296296296296297

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}13{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ECU_AL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ECU_AL "RC: All Lags"
{txt}
{com}. 
. keep if country_code == "ECU"
{txt}(675 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1  year using RC_ECU
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ECU, replace
{txt}{p 0 4 2}
file {bf}
RC_ECU.dta{rm}
saved
{p_end}

{com}. 
. *| Robustness Check 3 - Drop Developed Countries
. *| -- Retain the same specification as suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1993
{txt}(364 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(25 observations deleted)

{com}. drop if country=="Austria"
{txt}(25 observations deleted)

{com}. drop if country=="Belgium"
{txt}(25 observations deleted)

{com}. drop if country=="Canada"
{txt}(25 observations deleted)

{com}. drop if country=="Denmark"
{txt}(25 observations deleted)

{com}. drop if country=="France"
{txt}(25 observations deleted)

{com}. drop if country=="Germany"
{txt}(25 observations deleted)

{com}. drop if country=="Italy"
{txt}(25 observations deleted)

{com}. drop if country=="Japan"
{txt}(25 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(25 observations deleted)

{com}. drop if country=="Portugal"
{txt}(25 observations deleted)

{com}. drop if country=="Spain"
{txt}(25 observations deleted)

{com}. drop if country=="Sweden"
{txt}(25 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(25 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "EFW polity2 VDEM4 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1993(1)2017"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(13) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 13 of out 13 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Ecuador {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Nigeria, Paraguay, Peru, Thailand, Turkey, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} EFW polity2 VDEM4 ICRG VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .5909388}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
   Algeria {c |}           {res}0
    {txt}Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}        {res}.769
{txt}Costa Rica {c |}        {res}.108
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}           {res}0
   {txt}Nigeria {c |}           {res}0
  {txt}Paraguay {c |}           {res}0
      {txt}Peru {c |}           {res}0
  {txt}Thailand {c |}         {res}.05
    {txt}Turkey {c |}        {res}.073
   {txt}Uruguay {c |}           {res}0
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  6.08495}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.456598}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 7.571429}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.614571}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-98.86429}}}{space 1}{space 1}{ralign 9:{res:{sf:-43.11877}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.943452}}}{space 1}{space 1}{ralign 9:{res:{sf:   2.6535}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.9156}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.1881}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.5364}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  48.0295}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(13) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 13}| Total: 13
............| 2.00s elapsed. 

Conducting inference: 5 steps, and 13 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-6.625301}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.7818}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -15.7084}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -19.578}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.9726}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -23.6934}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -27.3401}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -26.8273}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -26.5559}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -25.0931}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.6499}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}13
          {txt}e(n_pl_used) =  {res}13
    {txt}e(pval_joint_post) =  {res}.1538461538461539
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}1

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}13{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ECU_DD
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ECU_DD "RC: Drop Developed"
{txt}
{com}. 
. keep if country_code == "ECU"
{txt}(325 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_ECU
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ECU, replace
{txt}{p 0 4 2}
file {bf}
RC_ECU.dta{rm}
saved
{p_end}

{com}. 
. *| Robustness Check 4 - Only Latin American Donor
. *| -- Retain the same specification as the suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(39 observations deleted)

{com}. drop if country=="Austria"
{txt}(39 observations deleted)

{com}. drop if country=="Belgium"
{txt}(39 observations deleted)

{com}. drop if country=="Canada"
{txt}(39 observations deleted)

{com}. drop if country=="Denmark"
{txt}(39 observations deleted)

{com}. drop if country=="France"
{txt}(39 observations deleted)

{com}. drop if country=="Germany"
{txt}(39 observations deleted)

{com}. drop if country=="Italy"
{txt}(39 observations deleted)

{com}. drop if country=="Japan"
{txt}(39 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(39 observations deleted)

{com}. drop if country=="Portugal"
{txt}(39 observations deleted)

{com}. drop if country=="Spain"
{txt}(39 observations deleted)

{com}. drop if country=="Sweden"
{txt}(39 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(39 observations deleted)

{com}. 
. * Drop non-Latin American
. drop if country=="Algeria"
{txt}(39 observations deleted)

{com}. drop if country=="Nigeria"
{txt}(39 observations deleted)

{com}. drop if country=="Thailand"
{txt}(39 observations deleted)

{com}. drop if country=="Turkey"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1993
{txt}(182 observations deleted)

{com}. drop if year > 2017
{txt}(14 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "EFW polity2 VDEM4 ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1993(1)2017"
{txt}
{com}. 
. synth VDEMy $predictors $pre_treatment, trunit(13) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 13 of out 13 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1999 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Ecuador {p_end}
{txt}{p 15 30 0} Control Units: {res}Argentina, Bolivia, Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Nicaragua, Paraguay, Peru, Uruguay, Venezuela {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} EFW polity2 VDEM4 ICRG VDEMy(1997) VDEMy(2002) VDEMy(2003) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.512658}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
 Argentina {c |}        {res}.255
   {txt}Bolivia {c |}        {res}.017
    {txt}Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}         {res}.44
{txt}Costa Rica {c |}           {res}0
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}           {res}0
 {txt}Nicaragua {c |}        {res}.271
  {txt}Paraguay {c |}           {res}0
      {txt}Peru {c |}        {res}.016
   {txt}Uruguay {c |}           {res}0
 {txt}Venezuela {c |}        {res}.002
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  6.08495}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.610404}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 7.571429}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.447286}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-98.86429}}}{space 1}{space 1}{ralign 9:{res:{sf:-60.26005}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.943452}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.861268}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.2803}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.8}}}{space 1}{space 1}{ralign 9:{res:{sf:    47.58}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     47.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  47.3735}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     46.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  46.5553}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(13) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 13}| Total: 13
............| 2.00s elapsed. 

Conducting inference: 5 steps, and 13 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -1.9419}}}{space 1}{space 1}{ralign 9:{res:{sf: .6153846}}}{space 1}{space 1}{ralign 9:{res:{sf: .4615385}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-7.899103}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -9.2831}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -12.191}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.8144}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -13.559}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.2509}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.1202}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.7688}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.2058}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-9.306301}}}{space 1}{space 1}{ralign 9:{res:{sf: .5384615}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}13
          {txt}e(n_pl_used) =  {res}13
    {txt}e(pval_joint_post) =  {res}.1538461538461539
  {txt}e(pval_joint_post_s
    td)                =  {res}.0769230769230769
    {txt}e(avg_pre_rmspe_p) =  {res}.6923076923076923

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}13{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 25 x 2
{txt}
{com}. 
. rename  VDEMy_synth     ECU_LA
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  ECU_LA "RC: Latin America Only"
{txt}
{com}. 
. keep if country_code == "ECU"
{txt}(325 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_ECU
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              25{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_ECU, replace
{txt}{p 0 4 2}
file {bf}
RC_ECU.dta{rm}
saved
{p_end}

{com}. 
. * PLOT
. 
. global title    = "V-Dem: Liberal Democracy Index in Ecuador"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Ecuador"
{txt}
{com}. global label2   = "Baseline Synthetic"
{txt}
{com}. global label3   = "RC: Drop Largest Donor"
{txt}
{com}. global label4   = "RC: All Pre-Treat Lags"
{txt}
{com}. global label5   = "RC: Drop Developed"
{txt}
{com}. global label6   = "RC: Latin America Only"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy         year, lpattern(solid) lwidth (medthick)        ///
>         || line ECU_BL    year, lpattern(dash) lwidth(medthick) lcolor(stred)    ///
>         || line ECU_DL    year, lpattern(shortdash) lwidth(medthin) lcolor(gray%85)      ///
>         || line ECU_AL    year, lpattern(shortdash_dot) lwidth(medthin) lcolor(gray%85)  ///
>         || line ECU_DD    year, lpattern(longdash) lwidth(medthin) lcolor(gray%85)       ///
>         || line ECU_LA    year, lpattern(longdash_dot) lwidth(medthin) lcolor(gray%85)   ///
>            xline($treat_graph)   ///
>            xlabel(1990(5)2015)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) label(3 $label3)                     ///
>            label(4 $label4) label(5 $label5) label(6 $label6)                                   ///
>            position(6) rows(2)) 
{res}{txt}
{com}.            graph save "Figures/JP/ECU_RC", replace   
{txt}{p 0 4 2}
(file {bf}
Figures/JP/ECU_RC.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/ECU_RC.gph} saved

{com}. 
. graph export  "Figures/JP/Fig_RC_ECU.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_RC_ECU.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. 
. *| Nicaragua
. *|------------------------------------------------------------------------------
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1997
{txt}(476 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM2 VDEM4 WGI1 polity2 WGI3"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1997(1)2017"
{txt}
{com}. 
. synth VDEMy $predictors $pre_treatment, trunit(21) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Nicaragua {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM2 VDEM4 WGI1 polity2 WGI3 VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.718023}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}        {res}.132
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.659
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.209
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    87.13}}}{space 1}{space 1}{ralign 9:{res:{sf: 71.77594}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    -9.99}}}{space 1}{space 1}{ralign 9:{res:{sf:-52.79375}}}{space 1}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.0539207}}}{space 1}{space 1}{ralign 9:{res:{sf:-.3399278}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:   6.0034}}}{space 1}
{space 0}{space 0}{ralign 30:WGI3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.6647049}}}{space 1}{space 1}{ralign 9:{res:{sf:-.3275297}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     41.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  37.8861}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.7262}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.4867}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.5455}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     33.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  35.2556}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.           
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(21) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 7.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.7313}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.8202}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -19.6443}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.2177}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -26.1679}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -30.1981}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -32.1441}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -27.7235}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -27.6859}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -28.088}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -29.5857}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{res}{txt}
{com}. ereturn list                    

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}0
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.2222222222222222

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}21{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 21 x 2
{txt}
{com}.                         
. rename  VDEMy_synth     NIC_BL
{res}{txt}
{com}. drop    effect
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  NIC_BL "Baseline: Nicaragua"
{txt}
{com}. 
. keep if country_code == "NIC"
{txt}(567 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. save RC_NIC, replace
{txt}{p 0 4 2}
(file {bf}
RC_NIC.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
RC_NIC.dta{rm}
saved
{p_end}

{com}. 
. *| Robustness Check 1 - Drop Largest Donor
. *|      -- Largest Donor == Colombia (0.520)
. *|      -- Same specification as suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if country=="Colombia"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1997
{txt}(459 observations deleted)

{com}. drop if year > 2017
{txt}(27 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM2 VDEM4 WGI1 polity2 WGI3"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1997(1)2017"
{txt}
{com}. 
. synth VDEMy $predictors $pre_treatment, trunit(21) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Nicaragua {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM2 VDEM4 WGI1 polity2 WGI3 VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.704592}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}        {res}.536
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}        {res}.067
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}        {res}.212
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.186
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    87.13}}}{space 1}{space 1}{ralign 9:{res:{sf: 74.27119}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    -9.99}}}{space 1}{space 1}{ralign 9:{res:{sf: 53.01027}}}{space 1}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.0539207}}}{space 1}{space 1}{ralign 9:{res:{sf:-.1778486}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:   3.3996}}}{space 1}
{space 0}{space 0}{ralign 30:WGI3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.6647049}}}{space 1}{space 1}{ralign 9:{res:{sf:-.1399428}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     41.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  37.5373}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.7346}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.2}}}{space 1}{space 1}{ralign 9:{res:{sf:   38.751}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.4275}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     33.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  34.6828}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.           
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(21) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 26}| Total: 26
.........................| 8.00s elapsed. 

Conducting inference: 5 steps, and 26 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -12.5096}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.0052}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.8239}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.2308}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -19.6464}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -23.2208}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.7415}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.4564}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0384615}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -20.084}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.2675}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -21.4388}}}{space 1}{space 1}{ralign 9:{res:{sf: .1153846}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{res}{txt}
{com}. ereturn list 

{txt}scalars:
               e(n_pl) =  {res}26
          {txt}e(n_pl_used) =  {res}26
    {txt}e(pval_joint_post) =  {res}.0384615384615385
  {txt}e(pval_joint_post_s
    td)                =  {res}.0384615384615385
    {txt}e(avg_pre_rmspe_p) =  {res}.2307692307692308

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}21{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 21 x 2
{txt}
{com}. 
. rename  VDEMy_synth     NIC_DL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  NIC_DL "RC: Drop Largest"
{txt}
{com}. 
. keep if country_code == "NIC"
{txt}(546 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_NIC
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              21{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_NIC, replace            
{txt}{p 0 4 2}
file {bf}
RC_NIC.dta{rm}
saved
{p_end}

{com}. 
. 
. * Robustness Check 2 - All Pre-Treatment Lags 
. *       -- Following Ferman, Pinto & Possebom (2020)
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1997
{txt}(476 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1997(1)2017"
{txt}
{com}. 
. 
. synth VDEMy VDEMy(1997) VDEMy(1998) VDEMy(1999) VDEMy(2000)                                      ///
>           VDEMy(2001) VDEMy(2002) VDEMy(2003) VDEMy(2004)                                                ///
>           VDEMy(2005) VDEMy(2006) VDEMy(2007), trunit(21) trperiod($treat_y)     ///
>           unitnames(country) resultsperiod($x_axis)                                                              
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Nicaragua {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEMy(1997) VDEMy(1998) VDEMy(1999) VDEMy(2000) VDEMy(2001) VDEMy(2002) VDEMy(2003) VDEMy(2004) VDEMy(2005) VDEMy(2006) VDEMy(2007){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.622258}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}        {res}.284
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.345
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}           {res}0
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}        {res}.115
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}        {res}.256
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     41.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  37.8804}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     41.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.5232}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1999)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.5723}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2000)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.8324}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  39.2498}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  39.0951}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2003)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.7102}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.8345}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2005)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.5574}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     33.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  33.9408}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2007)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     22.3}}}{space 1}{space 1}{ralign 9:{res:{sf:   34.462}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.           
.     
. synth_runner VDEMy VDEMy(1997) VDEMy(1998) VDEMy(1999) VDEMy(2000)                      ///
>                          VDEMy(2001) VDEMy(2002) VDEMy(2003) VDEMy(2004) VDEMy(2005)    ///
>                          VDEMy(2006) VDEMy(2007), trunit(21) trperiod($treat_y)                                         ///
>                          gen_vars synthsettings(unitnames(country))                                             ///
>                          
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 7.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -12.162}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.9859}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.7922}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf: .0740741}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.2834}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -23.2431}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -27.1618}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -28.5383}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: .1851852}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.7898}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.4925}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf: .2222222}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.8315}}}{space 1}{space 1}{ralign 9:{res:{sf: .1481481}}}{space 1}{space 1}{ralign 9:{res:{sf: .2592593}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.1545}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf: .2592593}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}.0740740740740741
  {txt}e(pval_joint_post_s
    td)                =  {res}.2222222222222222
    {txt}e(avg_pre_rmspe_p) =  {res}.1481481481481481

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}21{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 21 x 2
{txt}
{com}. 
. rename  VDEMy_synth     NIC_AL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  NIC_AL "RC: All Lags"
{txt}
{com}. 
. keep if country_code == "NIC"
{txt}(567 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1  year using RC_NIC
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              21{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_NIC, replace
{txt}{p 0 4 2}
file {bf}
RC_NIC.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *| Robustness Check 3 - Drop Developed Countries
. *| -- Retain the same specification as suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1997
{txt}(476 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(21 observations deleted)

{com}. drop if country=="Austria"
{txt}(21 observations deleted)

{com}. drop if country=="Belgium"
{txt}(21 observations deleted)

{com}. drop if country=="Canada"
{txt}(21 observations deleted)

{com}. drop if country=="Denmark"
{txt}(21 observations deleted)

{com}. drop if country=="France"
{txt}(21 observations deleted)

{com}. drop if country=="Germany"
{txt}(21 observations deleted)

{com}. drop if country=="Italy"
{txt}(21 observations deleted)

{com}. drop if country=="Japan"
{txt}(21 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(21 observations deleted)

{com}. drop if country=="Portugal"
{txt}(21 observations deleted)

{com}. drop if country=="Spain"
{txt}(21 observations deleted)

{com}. drop if country=="Sweden"
{txt}(21 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(21 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM2 VDEM4 WGI1 polity2 WGI3"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1997(1)2017"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(21) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                  ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Nicaragua {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Nigeria, Paraguay, Peru, Thailand, Turkey, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM2 VDEM4 WGI1 polity2 WGI3 VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.192169}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
   Algeria {c |}        {res}.415
    {txt}Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}           {res}0
{txt}Costa Rica {c |}           {res}0
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}           {res}0
   {txt}Nigeria {c |}        {res}.129
  {txt}Paraguay {c |}           {res}0
      {txt}Peru {c |}           {res}0
  {txt}Thailand {c |}        {res}.232
    {txt}Turkey {c |}           {res}0
   {txt}Uruguay {c |}        {res}.224
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    87.13}}}{space 1}{space 1}{ralign 9:{res:{sf:  75.0294}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    -9.99}}}{space 1}{space 1}{ralign 9:{res:{sf: 20.46738}}}{space 1}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.0539207}}}{space 1}{space 1}{ralign 9:{res:{sf:-.2653811}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:   3.7032}}}{space 1}
{space 0}{space 0}{ralign 30:WGI3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.6647049}}}{space 1}{space 1}{ralign 9:{res:{sf:-.3093376}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     41.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  33.7181}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.7913}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.7449}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.0485}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     33.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  33.3355}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(21) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                              
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 13}| Total: 13
............| 3.00s elapsed. 

Conducting inference: 5 steps, and 13 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -11.1974}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -16.2986}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.0746}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.8574}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -19.9548}}}{space 1}{space 1}{ralign 9:{res:{sf: .0769231}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -24.0525}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -25.9617}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.6324}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf: .1538462}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.5236}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -20.5572}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -21.8511}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}{space 1}{ralign 9:{res:{sf: .2307692}}}{space 1}
{res}{txt}
{com}. 
. ereturn list

{txt}scalars:
               e(n_pl) =  {res}13
          {txt}e(n_pl_used) =  {res}13
    {txt}e(pval_joint_post) =  {res}.0769230769230769
  {txt}e(pval_joint_post_s
    td)                =  {res}.1538461538461539
    {txt}e(avg_pre_rmspe_p) =  {res}.3846153846153846

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}21{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 21 x 2
{txt}
{com}. 
. rename  VDEMy_synth     NIC_DD
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  NIC_DD "RC: Drop Developed"
{txt}
{com}. 
. keep if country_code == "NIC"
{txt}(273 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_NIC
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              21{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_NIC, replace
{txt}{p 0 4 2}
file {bf}
RC_NIC.dta{rm}
saved
{p_end}

{com}. 
. *| Robustness Check 4 - Only Latin American Donors
. *| -- Retain the same specification as baseline
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="VEN"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1997
{txt}(476 observations deleted)

{com}. drop if year > 2017
{txt}(28 observations deleted)

{com}. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(21 observations deleted)

{com}. drop if country=="Austria"
{txt}(21 observations deleted)

{com}. drop if country=="Belgium"
{txt}(21 observations deleted)

{com}. drop if country=="Canada"
{txt}(21 observations deleted)

{com}. drop if country=="Denmark"
{txt}(21 observations deleted)

{com}. drop if country=="France"
{txt}(21 observations deleted)

{com}. drop if country=="Germany"
{txt}(21 observations deleted)

{com}. drop if country=="Italy"
{txt}(21 observations deleted)

{com}. drop if country=="Japan"
{txt}(21 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(21 observations deleted)

{com}. drop if country=="Portugal"
{txt}(21 observations deleted)

{com}. drop if country=="Spain"
{txt}(21 observations deleted)

{com}. drop if country=="Sweden"
{txt}(21 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(21 observations deleted)

{com}. 
. * Drop non-Latin American
. drop if country=="Algeria"
{txt}(21 observations deleted)

{com}. drop if country=="Nigeria"
{txt}(21 observations deleted)

{com}. drop if country=="Thailand"
{txt}(21 observations deleted)

{com}. drop if country=="Turkey"
{txt}(21 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "VDEM2 VDEM4 WGI1 polity2 WGI3"
{txt}
{com}. global pre_treatment = "VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006)"
{txt}
{com}. global treat_y       = "2007"
{txt}
{com}. global x_axis            = "1997(1)2017"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(21) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                  ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 2001 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 1999 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI3 in period 2001 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Nicaragua {p_end}
{txt}{p 15 30 0} Control Units: {res}Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Paraguay, Peru, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEM2 VDEM4 WGI1 polity2 WGI3 VDEMy(1997) VDEMy(2001) VDEMy(2002) VDEMy(2004) VDEMy(2006){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1997 1998 1999 2000 2001 2002 2003 2004 2005 2006{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 5.295936}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
    Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}        {res}.116
{txt}Costa Rica {c |}           {res}0
 {txt}Guatemala {c |}        {res}.832
    {txt}Mexico {c |}           {res}0
  {txt}Paraguay {c |}        {res}.052
      {txt}Peru {c |}           {res}0
   {txt}Uruguay {c |}           {res}0
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    87.13}}}{space 1}{space 1}{ralign 9:{res:{sf: 74.14184}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:    -9.99}}}{space 1}{space 1}{ralign 9:{res:{sf:-26.89692}}}{space 1}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.0539207}}}{space 1}{space 1}{ralign 9:{res:{sf:-.3194499}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:   7.8476}}}{space 1}
{space 0}{space 0}{ralign 30:WGI3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.6647049}}}{space 1}{space 1}{ralign 9:{res:{sf:-.7233316}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     41.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  31.7992}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2001)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.2376}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2002)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     38.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  38.3692}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2004)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     37.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  39.8948}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(2006)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     33.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  40.0592}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(21) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                              
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 9}| Total: 9
........| 1.00s elapsed. 

Conducting inference: 5 steps, and 9 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.6852}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -21.126}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.0728}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -22.8268}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   -23.57}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -25.8688}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -30.582}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -31.3144}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -33.1524}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -35.3528}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -36.7812}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. 
. ereturn list

{txt}scalars:
               e(n_pl) =  {res}9
          {txt}e(n_pl_used) =  {res}9
    {txt}e(pval_joint_post) =  {res}0
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.2222222222222222

{txt}macros:
           e(trperiod) : "{res}2007{txt}"
             e(trunit) : "{res}21{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 21 x 2
{txt}
{com}. 
. rename  VDEMy_synth     NIC_LA
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  NIC_LA "RC: Latin America Only"
{txt}
{com}. 
. keep if country_code == "NIC"
{txt}(189 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_NIC
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              21{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_NIC, replace
{txt}{p 0 4 2}
file {bf}
RC_NIC.dta{rm}
saved
{p_end}

{com}. 
. global title    = "V-Dem: Liberal Democracy Index in Nicaragua"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Nicaragua"
{txt}
{com}. global label2   = "Baseline Synthetic"
{txt}
{com}. global label3   = "RC: Drop Largest Donor"
{txt}
{com}. global label4   = "RC: All Pre-Treat Lags"
{txt}
{com}. global label5   = "RC: Drop Developed"
{txt}
{com}. global label6   = "RC: Latin America Only"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy         year, lpattern(solid) lwidth (medthick)        ///
>         || line NIC_BL    year, lpattern(dash) lwidth(medthick) lcolor(stred)    ///
>         || line NIC_DL    year, lpattern(shortdash) lwidth(medthin) lcolor(gray%85)      ///
>         || line NIC_AL    year, lpattern(shortdash_dot) lwidth(medthin) lcolor(gray%85)  ///
>         || line NIC_DD    year, lpattern(longdash) lwidth(medthin) lcolor(gray%85)       ///
>         || line NIC_LA    year, lpattern(longdash_dot) lwidth(medthin) lcolor(gray%85)   ///
>            xline($treat_graph)   ///
>            xlabel(1995(5)2020)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) label(3 $label3)                     ///
>            label(4 $label4) label(5 $label5) label(6 $label6)                                   ///
>            position(6) rows(2)) 
{res}{txt}
{com}.            graph save "Figures/JP/NIC_RC", replace   
{txt}{p 0 4 2}
(file {bf}
Figures/JP/NIC_RC.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/NIC_RC.gph} saved

{com}. 
. graph export  "Figures/JP/Fig_RC_NIC.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_RC_NIC.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. *| Venezuela
. *|------------------------------------------------------------------------------
. 
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1980
{txt}(0 observations deleted)

{com}. drop if year > 2009
{txt}(252 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "WGI1 VDEM2 VDEM3 polity2 EFW ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998)"
{txt}
{com}. global treat_y       = "1999"
{txt}
{com}. global x_axis            = "1980(1)2008"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(32) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1981 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1982 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1983 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1984 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1986 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1987 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1988 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1989 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1980 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1981 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1982 -ignored for averaging
control units: for 27 of out 27 units missing obs for predictor ICRG in period 1983 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1984 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1985 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1986 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1987 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1988 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1989 -ignored for averaging
control units: for 1 of out 27 units missing obs for predictor ICRG in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1983 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Venezuela {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 VDEM2 VDEM3 polity2 EFW ICRG VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.621517}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}           {res}0
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.066
    {txt}Costa Rica {c |}        {res}.609
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}        {res}.251
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}        {res}.051
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}        {res}.024
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0106699}}}{space 1}{space 1}{ralign 9:{res:{sf: .3188281}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 89.54211}}}{space 1}{space 1}{ralign 9:{res:{sf: 85.41379}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-44.38421}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.833293}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.631579}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.266842}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 5.690285}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.540844}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.961111}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.970189}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1988)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  57.8722}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1991)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  60.3001}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.4343}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     58.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.8313}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}. 
.     
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(32) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 9.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.1374}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -34.5545}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -38.9838}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -42.8513}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -43.1161}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -45.5689}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -49.196}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -50.7954}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -51.3276}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -51.8648}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -52.0219}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list                    

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}0
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.4444444444444444

{txt}macros:
           e(trperiod) : "{res}1999{txt}"
             e(trunit) : "{res}32{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 30 x 2
{txt}
{com}.                         
. rename  VDEMy_synth     VEN_BL
{res}{txt}
{com}. drop    effect
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  VEN_BL "Baseline: Venezuela"
{txt}
{com}. 
. keep if country_code == "VEN"
{txt}(810 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. save RC_VEN, replace
{txt}{p 0 4 2}
(file {bf}
RC_VEN.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
RC_VEN.dta{rm}
saved
{p_end}

{com}. 
. 
. *| Robustness Check 1 - Drop Largest Donor
. *|      -- Largest Donor == Costa Rica (0.437)
. *|      -- Same specification as suggestion above
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. 
. drop if country=="Costa Rica"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1980
{txt}(0 observations deleted)

{com}. drop if year > 2009
{txt}(243 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "WGI1 VDEM2 VDEM3 polity2 EFW ICRG"
{txt}
{com}. global pre_treatment = "VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998)"
{txt}
{com}. global treat_y       = "1999"
{txt}
{com}. global x_axis            = "1980(1)2008"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(32) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
> 
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1981 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1982 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1983 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1984 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1986 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1987 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1988 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1989 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor ICRG in period 1980 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor ICRG in period 1981 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor ICRG in period 1982 -ignored for averaging
control units: for 26 of out 26 units missing obs for predictor ICRG in period 1983 -ignored for averaging
control units: for 1 of out 26 units missing obs for predictor ICRG in period 1984 -ignored for averaging
control units: for 1 of out 26 units missing obs for predictor ICRG in period 1985 -ignored for averaging
control units: for 1 of out 26 units missing obs for predictor ICRG in period 1986 -ignored for averaging
control units: for 1 of out 26 units missing obs for predictor ICRG in period 1987 -ignored for averaging
control units: for 1 of out 26 units missing obs for predictor ICRG in period 1988 -ignored for averaging
control units: for 1 of out 26 units missing obs for predictor ICRG in period 1989 -ignored for averaging
control units: for 1 of out 26 units missing obs for predictor ICRG in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor ICRG in period 1983 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Venezuela {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 VDEM2 VDEM3 polity2 EFW ICRG VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  3.46116}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}           {res}0
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}        {res}.101
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}           {res}0
      {txt}Colombia {c |}        {res}.067
       {txt}Denmark {c |}           {res}0
        {txt}France {c |}        {res}.581
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}        {res}.252
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}           {res}0
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}           {res}0
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0106699}}}{space 1}{space 1}{ralign 9:{res:{sf: .3897614}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 89.54211}}}{space 1}{space 1}{ralign 9:{res:{sf: 84.11944}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-44.38421}}}{space 1}{space 1}{ralign 9:{res:{sf: 48.39099}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.631579}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.855789}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 5.690285}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.751371}}}{space 1}
{space 0}{space 0}{ralign 30:ICRG}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 2.961111}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.029572}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1988)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  56.6233}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1991)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.2149}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.4469}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     58.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.5259}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}

{com}.           
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(32) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 26}| Total: 26
.........................| 8.00s elapsed. 

Conducting inference: 5 steps, and 26 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -17.8961}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -34.0531}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -36.5464}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -39.8046}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -40.067}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -42.5536}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -46.7147}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -48.0622}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -48.7675}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -49.6581}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -49.6967}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list 

{txt}scalars:
               e(n_pl) =  {res}26
          {txt}e(n_pl_used) =  {res}26
    {txt}e(pval_joint_post) =  {res}0
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.4230769230769231

{txt}macros:
           e(trperiod) : "{res}1999{txt}"
             e(trunit) : "{res}32{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 30 x 2
{txt}
{com}. 
. rename  VDEMy_synth     VEN_DL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  VEN_DL "RC: Drop Largest"
{txt}
{com}. 
. keep if country_code == "VEN"
{txt}(780 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_VEN
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              30{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_VEN, replace
{txt}{p 0 4 2}
file {bf}
RC_VEN.dta{rm}
saved
{p_end}

{com}. 
. * Robustness Check 2 - All Pre-Treatment Lags 
. *       -- Following Ferman, Pinto & Possebom (2020)
. 
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1980
{txt}(0 observations deleted)

{com}. drop if year > 2008
{txt}(280 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global treat_y       = "1999"
{txt}
{com}. global x_axis            = "1980(1)2008"
{txt}
{com}. 
. 
. synth VDEMy VDEMy(1980) VDEMy(1981) VDEMy(1982) VDEMy(1983) VDEMy(1984)                 ///
>           VDEMy(1985) VDEMy(1986) VDEMy(1987) VDEMy(1988) VDEMy(1989) VDEMy(1990)       ///
>           VDEMy(1991) VDEMy(1992) VDEMy(1993) VDEMy(1994) VDEMy(1995) VDEMy(1996)       ///
>           VDEMy(1997) VDEMy(1999), trunit(32) trperiod($treat_y)                                        ///
>           unitnames(country) resultsperiod($x_axis)                                                                     ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Venezuela {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark, France, Germany, Guatemala, Italy, Japan, Mexico, Netherlands, Nigeria, Paraguay, Peru, Portugal, Spain, Sweden, Thailand, Turkey, United Kingdom, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEMy(1980) VDEMy(1981) VDEMy(1982) VDEMy(1983) VDEMy(1984) VDEMy(1985) VDEMy(1986) VDEMy(1987) VDEMy(1988) VDEMy(1989) VDEMy(1990) VDEMy(1991) VDEMy(1992) VDEMy(1993) VDEMy(1994) VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1999){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .6175278}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 15}{c TT}{hline 12}
         Co_No {c |} Unit_Weight
{hline 15}{c +}{hline 12}
       Algeria {c |}           {res}0
     {txt}Australia {c |}        {res}.585
       {txt}Austria {c |}           {res}0
       {txt}Belgium {c |}           {res}0
        {txt}Brazil {c |}        {res}.007
        {txt}Canada {c |}           {res}0
         {txt}Chile {c |}        {res}.017
      {txt}Colombia {c |}        {res}.078
    {txt}Costa Rica {c |}           {res}0
       {txt}Denmark {c |}        {res}.018
        {txt}France {c |}           {res}0
       {txt}Germany {c |}           {res}0
     {txt}Guatemala {c |}           {res}0
         {txt}Italy {c |}           {res}0
         {txt}Japan {c |}           {res}0
        {txt}Mexico {c |}           {res}0
   {txt}Netherlands {c |}           {res}0
       {txt}Nigeria {c |}        {res}.198
      {txt}Paraguay {c |}           {res}0
          {txt}Peru {c |}        {res}.033
      {txt}Portugal {c |}           {res}0
         {txt}Spain {c |}           {res}0
        {txt}Sweden {c |}           {res}0
      {txt}Thailand {c |}           {res}0
        {txt}Turkey {c |}        {res}.063
{txt}United Kingdom {c |}           {res}0
       {txt}Uruguay {c |}           {res}0
{txt}{hline 15}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEMy(1980)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       60}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.6106}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1981)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.5518}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1982)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.6414}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1983)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.6819}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1984)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.1}}}{space 1}{space 1}{ralign 9:{res:{sf:   58.878}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1985)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     58.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  58.9542}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1986)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     58.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  58.9614}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1987)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     58.8}}}{space 1}{space 1}{ralign 9:{res:{sf:  58.8858}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1988)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.0028}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1989)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.0793}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1990)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  60.9416}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1991)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  61.8423}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1992)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  61.4891}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1993)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.3}}}{space 1}{space 1}{ralign 9:{res:{sf:  62.1998}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  61.1386}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1995)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     61.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  61.1391}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1996)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     61.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  61.2615}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1997)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.9}}}{space 1}{space 1}{ralign 9:{res:{sf:  60.8895}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1999)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     45.2}}}{space 1}{space 1}{ralign 9:{res:{sf:  63.8476}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
.     
. synth_runner VDEMy VDEMy VDEMy(1980) VDEMy(1981) VDEMy(1982) VDEMy(1983)        ///
>                          VDEMy(1984) VDEMy(1985) VDEMy(1986) VDEMy(1987) VDEMy(1988)    ///     
>                          VDEMy(1989) VDEMy(1990) VDEMy(1991) VDEMy(1992) VDEMy(1993)    ///
>                          VDEMy(1994) VDEMy(1995) VDEMy(1996) VDEMy(1997) VDEMy(1999),   ///
>                          trunit(32) trperiod($treat_y)                                                              ///
>                          gen_vars                                                                                                               ///
>                          synthsettings(unitnames(country))                                                         ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 27}| Total: 27
..........................| 15.00s elapsed. 

Conducting inference: 5 steps, and 27 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -18.7812}}}{space 1}{space 1}{ralign 9:{res:{sf:  .037037}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -35.3586}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -38.9565}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -42.4418}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -42.8994}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -45.4682}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -49.2127}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -50.5557}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -50.865}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -51.4678}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. 
. ereturn list

{txt}scalars:
               e(n_pl) =  {res}27
          {txt}e(n_pl_used) =  {res}27
    {txt}e(pval_joint_post) =  {res}0
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}.4444444444444444

{txt}macros:
           e(trperiod) : "{res}1999{txt}"
             e(trunit) : "{res}32{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 10
          {txt}e(pvals_std) : {res} 1 x 10
              {txt}e(pvals) : {res} 1 x 10
      {txt}e(treat_control) : {res} 29 x 2
{txt}
{com}. 
. rename  VDEMy_synth     VEN_AL
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  VEN_AL "RC: All Lags"
{txt}
{com}. 
. keep if country_code == "VEN"
{txt}(783 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1  year using RC_VEN
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              29{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_VEN, replace
{txt}{p 0 4 2}
file {bf}
RC_VEN.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *| Robustness Check 3 - Drop Developed Countries
. *| -- Drop VDEM 3 and ICRG as predictors 
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1980
{txt}(0 observations deleted)

{com}. drop if year > 2009
{txt}(252 observations deleted)

{com}. 
. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(30 observations deleted)

{com}. drop if country=="Austria"
{txt}(30 observations deleted)

{com}. drop if country=="Belgium"
{txt}(30 observations deleted)

{com}. drop if country=="Canada"
{txt}(30 observations deleted)

{com}. drop if country=="Denmark"
{txt}(30 observations deleted)

{com}. drop if country=="France"
{txt}(30 observations deleted)

{com}. drop if country=="Germany"
{txt}(30 observations deleted)

{com}. drop if country=="Italy"
{txt}(30 observations deleted)

{com}. drop if country=="Japan"
{txt}(30 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(30 observations deleted)

{com}. drop if country=="Portugal"
{txt}(30 observations deleted)

{com}. drop if country=="Spain"
{txt}(30 observations deleted)

{com}. drop if country=="Sweden"
{txt}(30 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(30 observations deleted)

{com}. 
. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "WGI1 VDEM2 polity2 EFW"
{txt}
{com}. global pre_treatment = "VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998)"
{txt}
{com}. global treat_y       = "1999"
{txt}
{com}. global x_axis            = "1980(1)2008"
{txt}
{com}. 
. 
. synth VDEMy  $pre_treatment $predictors, trunit(32) trperiod($treat_y)   ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1981 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1982 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1983 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1984 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1986 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1987 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1988 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1989 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 13 of out 13 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Venezuela {p_end}
{txt}{p 15 30 0} Control Units: {res}Algeria, Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Nigeria, Paraguay, Peru, Thailand, Turkey, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998) WGI1 VDEM2 polity2 EFW{p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.694459}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
   Algeria {c |}           {res}0
    {txt}Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}        {res}.142
{txt}Costa Rica {c |}        {res}.597
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}           {res}0
   {txt}Nigeria {c |}        {res}.173
  {txt}Paraguay {c |}           {res}0
      {txt}Peru {c |}        {res}.089
  {txt}Thailand {c |}           {res}0
    {txt}Turkey {c |}           {res}0
   {txt}Uruguay {c |}           {res}0
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:VDEMy(1988)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.1}}}{space 1}{space 1}{ralign 9:{res:{sf:  58.1064}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1991)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  61.0297}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.3365}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     58.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.7015}}}{space 1}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0106699}}}{space 1}{space 1}{ralign 9:{res:{sf:  .322132}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 89.54211}}}{space 1}{space 1}{ralign 9:{res:{sf: 84.52761}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.631579}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.915684}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 5.690285}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.611701}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
. 
. 
. synth_runner VDEMy  $pre_treatment $predictors,                                                          ///
>                          trunit(32) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                               ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 13}| Total: 13
............| 2.00s elapsed. 

Conducting inference: 5 steps, and 13 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -16.8698}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -32.9537}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -38.8304}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -43.0009}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -43.5467}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -46.0597}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -49.7238}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -51.3862}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -51.9172}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -52.4584}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -52.6057}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. ereturn list

{txt}scalars:
               e(n_pl) =  {res}13
          {txt}e(n_pl_used) =  {res}13
    {txt}e(pval_joint_post) =  {res}0
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}1

{txt}macros:
           e(trperiod) : "{res}1999{txt}"
             e(trunit) : "{res}32{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 30 x 2
{txt}
{com}. 
. rename  VDEMy_synth     VEN_DD
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  VEN_DD "RC: Drop Developed"
{txt}
{com}. 
. keep if country_code == "VEN"
{txt}(390 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_VEN
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              30{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_VEN, replace
{txt}{p 0 4 2}
file {bf}
RC_VEN.dta{rm}
saved
{p_end}

{com}. 
. 
. *| Robustness Check 4 - Only Latin American Donors
. *| -- Drop VDEM 3 and ICRG as predictors 
. 
. use data.dta, clear
{txt}
{com}. 
. drop if country_code=="ARG"     
{txt}(39 observations deleted)

{com}. drop if country_code=="BOL"
{txt}(39 observations deleted)

{com}. drop if country_code=="ECU"
{txt}(39 observations deleted)

{com}. drop if country_code=="NIC"
{txt}(39 observations deleted)

{com}. 
. drop if year < 1980
{txt}(0 observations deleted)

{com}. drop if year > 2009
{txt}(252 observations deleted)

{com}. 
. 
. * Drop developed counties 
. drop if country=="Australia"
{txt}(30 observations deleted)

{com}. drop if country=="Austria"
{txt}(30 observations deleted)

{com}. drop if country=="Belgium"
{txt}(30 observations deleted)

{com}. drop if country=="Canada"
{txt}(30 observations deleted)

{com}. drop if country=="Denmark"
{txt}(30 observations deleted)

{com}. drop if country=="France"
{txt}(30 observations deleted)

{com}. drop if country=="Germany"
{txt}(30 observations deleted)

{com}. drop if country=="Italy"
{txt}(30 observations deleted)

{com}. drop if country=="Japan"
{txt}(30 observations deleted)

{com}. drop if country=="Netherlands"
{txt}(30 observations deleted)

{com}. drop if country=="Portugal"
{txt}(30 observations deleted)

{com}. drop if country=="Spain"
{txt}(30 observations deleted)

{com}. drop if country=="Sweden"
{txt}(30 observations deleted)

{com}. drop if country=="Sweden"
{txt}(0 observations deleted)

{com}. drop if country=="United Kingdom"
{txt}(30 observations deleted)

{com}. 
. drop if country=="Algeria"
{txt}(30 observations deleted)

{com}. drop if country=="Nigeria"
{txt}(30 observations deleted)

{com}. drop if country=="Thailand"
{txt}(30 observations deleted)

{com}. drop if country=="Turkey"
{txt}(30 observations deleted)

{com}. 
. global convergence       = "nested allopt technique(nr)"
{txt}
{com}. global predictors    = "WGI1 VDEM2 polity2 EFW"
{txt}
{com}. global pre_treatment = "VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998)"
{txt}
{com}. global treat_y       = "1999"
{txt}
{com}. global x_axis            = "1980(1)2008"
{txt}
{com}. 
. 
. synth VDEMy $predictors $pre_treatment, trunit(32) trperiod($treat_y)    ///
>           unitnames(country) resultsperiod($x_axis)                                                      ///
>           fig
{txt}{hline}
{res}Synthetic Control Method for Comparative Case Studies
{txt}{hline}

{res}First Step: Data Setup
{txt}{hline}
{com}control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1980 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1985 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1990 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1995 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor WGI1 in period 1997 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1981 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1982 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1983 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1984 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1986 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1987 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1988 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1989 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1991 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1992 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1993 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1994 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1996 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1997 -ignored for averaging
control units: for 9 of out 9 units missing obs for predictor EFW in period 1998 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1981 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1982 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1983 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1984 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1986 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1987 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1988 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1989 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1991 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1992 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1993 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1994 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1996 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1997 -ignored for averaging
treated unit: for 1 of out 1 units missing obs for predictor EFW in period 1998 -ignored for averaging
{txt}{hline}
Data Setup successful
{hline}
{txt}{p 16 28 0} Treated Unit: {res}Venezuela {p_end}
{txt}{p 15 30 0} Control Units: {res}Brazil, Chile, Colombia, Costa Rica, Guatemala, Mexico, Paraguay, Peru, Uruguay {p_end}
{txt}{hline}
{txt}{p 10 30 0} Dependent Variable: {res}VDEMy {p_end}
{txt}{p 2 30 0} MSPE minimized for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{p 0 30 0} Results obtained for periods: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008{p_end}
{txt}{hline}
{txt}{p 18 30 0} Predictors:{res} WGI1 VDEM2 polity2 EFW VDEMy(1988) VDEMy(1991) VDEMy(1994) VDEMy(1998){p_end}
{txt}{hline}
{txt}{p 0 30 0} Unless period is specified {p_end}
{txt}{p 0 30 0} predictors are averaged over: {res}1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998{p_end}
{txt}{hline}

{res}Second Step: Run Optimization
{txt}{hline}
{res}{txt}{hline}
{res}Optimization done
{txt}{hline}

{res}Third Step: Obtain Results
{txt}{hline}
{res}Loss: Root Mean Squared Prediction Error

{txt}{space 0}{hline 9}{c  TT}{hline 11}
{space 0}{space 0}{ralign 8:RMSPE}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.228248}}}{space 1}
{space 0}{hline 9}{c  BT}{hline 11}
{hline}
{res}Unit Weights:

{txt}{hline 11}{c TT}{hline 12}
     Co_No {c |} Unit_Weight
{hline 11}{c +}{hline 12}
    Brazil {c |}           {res}0
     {txt}Chile {c |}           {res}0
  {txt}Colombia {c |}        {res}.538
{txt}Costa Rica {c |}        {res}.424
 {txt}Guatemala {c |}           {res}0
    {txt}Mexico {c |}           {res}0
  {txt}Paraguay {c |}           {res}0
      {txt}Peru {c |}        {res}.038
   {txt}Uruguay {c |}           {res}0
{txt}{hline 11}{c BT}{hline 12}
{hline}
{res}Predictor Balance:

{txt}{space 0}{hline 31}{c  TT}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:}{space 1}{c |}{space 1}{ralign 9:Treated}{space 1}{space 1}{ralign 9:Synthetic}{space 1}
{space 0}{hline 31}{c   +}{hline 11}{hline 11}
{space 0}{space 0}{ralign 30:WGI1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0106699}}}{space 1}{space 1}{ralign 9:{res:{sf: .2184279}}}{space 1}
{space 0}{space 0}{ralign 30:VDEM2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 89.54211}}}{space 1}{space 1}{ralign 9:{res:{sf: 79.85616}}}{space 1}
{space 0}{space 0}{ralign 30:polity2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 8.631579}}}{space 1}{space 1}{ralign 9:{res:{sf:    8.696}}}{space 1}
{space 0}{space 0}{ralign 30:EFW}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 5.690285}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.950772}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1988)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     59.1}}}{space 1}{space 1}{ralign 9:{res:{sf:   52.087}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1991)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     62.6}}}{space 1}{space 1}{ralign 9:{res:{sf:  58.3414}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1994)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     60.7}}}{space 1}{space 1}{ralign 9:{res:{sf:   59.573}}}{space 1}
{space 0}{space 0}{ralign 30:VDEMy(1998)}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     58.7}}}{space 1}{space 1}{ralign 9:{res:{sf:  59.2262}}}{space 1}
{space 0}{hline 31}{c  BT}{hline 11}{hline 11}
{hline}
{res}{txt}
{com}. 
. 
. 
. synth_runner VDEMy $predictors $pre_treatment,                                                           ///
>                          trunit(32) trperiod($treat_y)                                                                   ///
>                          gen_vars                                                                                                                ///
>                          synthsettings(unitnames(country))                                                               ///
> 
{res}Estimating the treatment effects
Estimating the possible placebo effects (one set for each of the 1 treatment periods)
|{col 9}| Total: 9
........| 1.00s elapsed. 

Conducting inference: 5 steps, and 9 placebo averages
Step 1... Finished
Step 2... Finished
Step 3... Finished
Step 4... Finished
Step 5... Finished

Post-treatment results: Effects, p-values, standardized p-values

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:estimates}{space 1}{space 1}{ralign 9:pvals}{space 1}{space 1}{ralign 9:pvals_std}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:c1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.7572}}}{space 1}{space 1}{ralign 9:{res:{sf: .1111111}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  -28.296}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   -32.19}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -35.7288}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -36.8054}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c6}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -39.5706}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c7}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -43.4124}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c8}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -45.6434}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c9}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -46.5554}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c10}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -47.2396}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:c11}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -47.4244}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{res}{txt}
{com}. 
. ereturn list

{txt}scalars:
               e(n_pl) =  {res}9
          {txt}e(n_pl_used) =  {res}9
    {txt}e(pval_joint_post) =  {res}0
  {txt}e(pval_joint_post_s
    td)                =  {res}0
    {txt}e(avg_pre_rmspe_p) =  {res}1

{txt}macros:
           e(trperiod) : "{res}1999{txt}"
             e(trunit) : "{res}32{txt}"
         e(treat_type) : "{res}single unit{txt}"
             e(depvar) : "{res}VDEMy{txt}"
                e(cmd) : "{res}synth_runner{txt}"
         e(properties) : "{res}b{txt}"

matrices:
                  e(b) : {res} 1 x 11
          {txt}e(pvals_std) : {res} 1 x 11
              {txt}e(pvals) : {res} 1 x 11
      {txt}e(treat_control) : {res} 30 x 2
{txt}
{com}. 
. rename  VDEMy_synth     VEN_LA
{res}{txt}
{com}. drop    effect  
{txt}
{com}. drop    pre_rmspe
{txt}
{com}. drop    post_rmspe
{txt}
{com}. drop    lead
{txt}
{com}. 
. label variable  VEN_LA "RC: Latin America Only"
{txt}
{com}. 
. keep if country_code == "VEN"
{txt}(270 observations deleted)

{com}. 
. drop VDEM1 VDEM2 VDEM3 VDEM4 VDEM5 VDEM6 WGI1 WGI2 WGI3
{txt}
{com}. drop ICRG polity EFW populist id country country_code
{txt}
{com}. 
. merge 1:1 year using RC_VEN
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              30{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save RC_VEN, replace
{txt}{p 0 4 2}
file {bf}
RC_VEN.dta{rm}
saved
{p_end}

{com}. 
. * Plots
. 
. global title    = "V-Dem: Liberal Democracy Index in Venezuela"
{txt}
{com}. global ytitle1  = "V-Dem: Liberal Democracy Index (0-100)"
{txt}
{com}. global ytitle2  = "Synthetic effect"
{txt}
{com}. global label1   = "Venezuela"
{txt}
{com}. global label2   = "Baseline Synthetic"
{txt}
{com}. global label3   = "RC: Drop Largest Donor"
{txt}
{com}. global label4   = "RC: All Pre-Treat Lags"
{txt}
{com}. global label5   = "RC: Drop Developed"
{txt}
{com}. global label6   = "RC: Latin America Only"
{txt}
{com}. global treat_graph  = $treat_y -1
{txt}
{com}. 
. twoway line VDEMy         year, lpattern(solid) lwidth (medthick)        ///
>         || line VEN_BL    year, lpattern(dash) lwidth(medthick) lcolor(stred)    ///
>         || line VEN_DL    year, lpattern(shortdash) lwidth(medthin) lcolor(gray%85)      ///
>         || line VEN_AL    year, lpattern(shortdash_dot) lwidth(medthin) lcolor(gray%85)  ///
>         || line VEN_DD    year, lpattern(longdash) lwidth(medthin) lcolor(gray%85)       ///
>         || line VEN_LA    year, lpattern(longdash_dot) lwidth(medthin) lcolor(gray%85)   ///
>            xline($treat_graph)   ///
>            xlabel(1980(5)2010)                                                                                                   ///
>            ytitle($ytitle1)                                                                                                      ///
>            legend(label(1 $label1) label(2 $label2) label(3 $label3)                     ///
>            label(4 $label4) label(5 $label5) label(6 $label6)                                   ///
>            position(6) rows(2)) 
{res}{txt}
{com}.            graph save "Figures/JP/VEN_RC", replace   
{txt}{p 0 4 2}
(file {bf}
Figures/JP/VEN_RC.gph{rm}
not found)
{p_end}
{res}{txt}file {bf:Figures/JP/VEN_RC.gph} saved

{com}. 
. graph export  "Figures/JP/Fig_RC_VEN.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/jpmvbastos/Documents/GitHub/populism-sca/Figures/JP/Fig_RC_VEN.png{rm}
saved as
PNG
format
{p_end}

{com}. graph drop _all
{txt}
{com}. 
. 
. *|==============================================================================
. *| REFERENCES
. *|
. *| Ferman, B., Pinto, C., & Possebom, V. (2020). Cherry picking with synthetic 
. *|              controls. Journal of Policy Analysis and Management, 39(2), 510-532.
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jpmvbastos/Documents/GitHub/populism-sca/RobustChecks.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}26 Nov 2023, 13:40:28
{txt}{.-}
{smcl}
{txt}{sf}{ul off}